index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2024-09-30 lun 23:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes Tópicos de Programación</title>
<meta name="author" content="likcos" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes Tópicos de Programación</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org553e721">Manual de Instalación de Git</a>
<ul>
<li><a href="#orgee89df7">Instalación en Windows</a></li>
<li><a href="#orge8bcf7c">Instalación en macOS</a>
<ul>
<li><a href="#org32f5efb">Método recomendado: usando Homebrew</a></li>
<li><a href="#org7b651f5">Método alternativo: paquete descargado</a></li>
</ul>
</li>
<li><a href="#org138317d">Instalación en Linux (Distribuciones basadas en Debian/Ubuntu)</a></li>
<li><a href="#orge7861e4">Configuración básica de Git</a></li>
<li><a href="#org4ca92c0">Actualización de Git</a></li>
<li><a href="#org4cad37f">Configurar Llave SSH con GitHub</a>
<ul>
<li><a href="#org1eeb284">1. Verificar si ya tienes una llave SSH</a></li>
<li><a href="#orga5ad079">2. Generar una nueva llave SSH</a></li>
<li><a href="#orgeaa7f13">3. Añadir la llave SSH al agente SSH</a></li>
<li><a href="#org9095fa6">4. Copiar la llave SSH pública</a></li>
<li><a href="#orgaeada8a">5. Añadir la llave SSH a GitHub</a></li>
<li><a href="#org8c291b3">6. Probar la conexión SSH con GitHub</a></li>
<li><a href="#orge1aea82">7. Usar la conexión SSH en repositorios de GitHub</a></li>
</ul>
</li>
<li><a href="#org4737c56">Configurar Llave SSH con GitHub en Windows</a>
<ul>
<li><a href="#org0320214">1. Abrir Git Bash</a></li>
<li><a href="#org3a5b0a3">2. Verificar si ya tienes una llave SSH</a></li>
<li><a href="#orgf3aa70a">3. Generar una nueva llave SSH</a></li>
<li><a href="#org8ddd442">4. Añadir la llave SSH al agente SSH</a></li>
<li><a href="#org27a9694">5. Copiar la llave SSH pública</a></li>
<li><a href="#org4c78a4e">6. Añadir la llave SSH a GitHub</a></li>
<li><a href="#org3ee2d78">7. Probar la conexión SSH con GitHub</a></li>
<li><a href="#org10db285">8. Usar la conexión SSH en repositorios de GitHub</a></li>
</ul>
</li>
<li><a href="#org06723a4">Manual de Git en Windows</a>
<ul>
<li><a href="#orgf86bb02">1. Instalar Git en Windows</a></li>
<li><a href="#org535fb7e">2. Configurar Git</a></li>
<li><a href="#orgf08f5cc">3. Clonar un repositorio</a></li>
<li><a href="#org1bb931a">4. Comandos básicos de Git</a></li>
<li><a href="#org9c49fd2">5. Actualizar el repositorio local</a></li>
<li><a href="#org766c7df">6. Crear y cambiar de ramas (branches)</a></li>
<li><a href="#org43b9482">7. Ver historial de commits</a></li>
<li><a href="#org882bdbc">8. Configurar una llave SSH</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6be6bcb">Manual de Instalación de Python en Windows</a>
<ul>
<li><a href="#org34f322b">Paso 1: Descarga de Python</a></li>
<li><a href="#org5822fc9">Paso 2: Ejecutar el instalador</a></li>
<li><a href="#org739a64e">Paso 3: Verificación de la instalación</a></li>
<li><a href="#orgcf8e24c">Paso 4: Instalar pip y otros paquetes</a></li>
<li><a href="#orgf082cc3">Paso 5: Configuración del entorno de desarrollo</a></li>
<li><a href="#orge58beef">Paso 6: Actualización de Python (opcional)</a></li>
</ul>
</li>
<li><a href="#org90c1e8b">Programación Avanzada</a>
<ul>
<li><a href="#orgc3e43d2">Estructuras de Datos</a>
<ul>
<li><a href="#orgc678998">1. ¿Qué son las estructuras de datos?</a></li>
<li><a href="#orgad9d5f5">2. Tipos comunes de estructuras de datos</a></li>
<li><a href="#orgfbc3b8d">3. Operaciones básicas en estructuras de datos</a></li>
<li><a href="#org8bda8a7">4. Consideraciones sobre la complejidad</a></li>
<li><a href="#orge941273">5. Ejemplo de aplicación</a></li>
<li><a href="#org87337ac">6. Conclusión</a></li>
</ul>
</li>
<li><a href="#orgedd2a5d">Estructuras de Datos en Python y C</a>
<ul>
<li><a href="#orgb726cf0">1. Arreglos (Arrays)</a></li>
<li><a href="#orgc25fe06">2. Listas enlazadas (Linked Lists)</a></li>
<li><a href="#org5cbe8e0">3. Pilas (Stacks)</a></li>
<li><a href="#orgc399bff">4. Colas (Queues)</a></li>
<li><a href="#org8c1ee5d">5. Árboles (Trees)</a></li>
<li><a href="#org20e8cd5">6. Grafos (Graphs)</a></li>
</ul>
</li>
<li><a href="#org40fbc70">Problema del Granjero, el Puma, la Cabra y la Lechuga</a>
<ul>
<li><a href="#org123d847">Descripción del Problema</a></li>
<li><a href="#orgd72f706">Representación del Estado</a></li>
<li><a href="#orge111039">Reglas de Transición</a></li>
<li><a href="#org690cd67">Algoritmo de Búsqueda en Profundidad (DFS)</a></li>
<li><a href="#org8e6c5f3">Árbol de Búsqueda</a></li>
<li><a href="#org77821c0">Solución del Problema</a></li>
</ul>
</li>
<li><a href="#orgc8c1585">Tutorial de Operaciones Bitwise en OpenCV</a>
<ul>
<li><a href="#org0eac491">1. Operación Bitwise AND</a></li>
<li><a href="#orgfa93649">2. Operación Bitwise OR</a></li>
<li><a href="#orgc616670">3. Operación Bitwise XOR</a></li>
<li><a href="#org03183ff">4. Operación Bitwise NOT</a></li>
<li><a href="#orgf76e5d6">5. Aplicaciones Prácticas</a></li>
<li><a href="#org568a5f8">Definición: Operación Bit a Bit</a></li>
</ul>
</li>
<li><a href="#org4aadcbe">Segmentación de color mediante el modelo de color HSV</a></li>
<li><a href="#org97b20d1">Seguimiento Por color</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org553e721" class="outline-2">
<h2 id="org553e721">Manual de Instalación de Git</h2>
<div class="outline-text-2" id="text-org553e721">
</div>
<div id="outline-container-orgee89df7" class="outline-3">
<h3 id="orgee89df7">Instalación en Windows</h3>
<div class="outline-text-3" id="text-orgee89df7">
<ul class="org-ul">
<li>Descarga el instalador desde [<a href="https://git-scm.com/">https://git-scm.com/</a>].</li>
</ul>



<ul class="org-ul">
<li>Haz clic en el botón “Download for Windows”.
<ul class="org-ul">
<li>Ejecuta el archivo descargado (.exe).</li>

<li>Configuración de las opciones recomendadas durante la instalación:
<ul class="org-ul">
<li>Seleccionar el editor por defecto (por ejemplo, Vim o Notepad++).</li>
<li>Usar Git desde la línea de comandos y aplicaciones de terceros (opción recomendada).</li>
<li>Opciones de formato de fin de línea: selecciona la opción predeterminada para Windows.</li>
</ul></li>

<li>Completa la instalación.</li>
<li>Verifica la instalación abriendo Git Bash o Command Prompt y ejecutando:</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">git --version
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8bcf7c" class="outline-3">
<h3 id="orge8bcf7c">Instalación en macOS</h3>
<div class="outline-text-3" id="text-orge8bcf7c">
</div>
<div id="outline-container-org32f5efb" class="outline-4">
<h4 id="org32f5efb">Método recomendado: usando Homebrew</h4>
<div class="outline-text-4" id="text-org32f5efb">
<ul class="org-ul">
<li>Si tienes Homebrew instalado, abre la terminal y ejecuta:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">brew install git
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b651f5" class="outline-4">
<h4 id="org7b651f5">Método alternativo: paquete descargado</h4>
<div class="outline-text-4" id="text-org7b651f5">
<ul class="org-ul">
<li>Descarga el instalador desde [<a href="https://git-scm.com/">https://git-scm.com/</a>].</li>
<li>Ejecuta el paquete descargado (.dmg).</li>
<li>Sigue las instrucciones de instalación.</li>

<li><p>
Verifica la instalación abriendo la terminal y ejecutando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git --version
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org138317d" class="outline-3">
<h3 id="org138317d">Instalación en Linux (Distribuciones basadas en Debian/Ubuntu)</h3>
<div class="outline-text-3" id="text-org138317d">
<ul class="org-ul">
<li><p>
Abre la terminal y ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     sudo apt update
     sudo apt install git
</pre>
</div></li>

<li><p>
Verifica la instalación ejecutando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git --version
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orge7861e4" class="outline-3">
<h3 id="orge7861e4">Configuración básica de Git</h3>
<div class="outline-text-3" id="text-orge7861e4">
<ul class="org-ul">
<li><p>
Configura tu nombre de usuario:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --global user.name <span style="color: #c3e88d;">"Tu Nombre"</span>
</pre>
</div></li>

<li><p>
Configura tu correo electrónico:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --global user.email <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li><p>
Verifica la configuración:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git config --list
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org4ca92c0" class="outline-3">
<h3 id="org4ca92c0">Actualización de Git</h3>
<div class="outline-text-3" id="text-org4ca92c0">
<ul class="org-ul">
<li><b>Windows</b>: Ejecuta el instalador más reciente desde el sitio oficial.</li>
<li><p>
<b>macOS</b>: Ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     brew upgrade git
</pre>
</div></li>
<li><p>
<b>Linux</b>: Ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     sudo apt update &amp;&amp; sudo apt upgrade git
</pre>
</div></li>
</ul>
</div>
</div>


<div id="outline-container-org4cad37f" class="outline-3">
<h3 id="org4cad37f">Configurar Llave SSH con GitHub</h3>
<div class="outline-text-3" id="text-org4cad37f">
</div>
<div id="outline-container-org1eeb284" class="outline-4">
<h4 id="org1eeb284">1. Verificar si ya tienes una llave SSH</h4>
<div class="outline-text-4" id="text-org1eeb284">
<ul class="org-ul">
<li><p>
Abre la terminal y ejecuta el siguiente comando para verificar si ya tienes llaves SSH generadas:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ls -al ~/.ssh
</pre>
</div></li>

<li>Si ves archivos como `id<sub>rsa</sub>` o `id<sub>ed25519</sub>`, ya tienes llaves SSH. Si no, continúa con el siguiente paso.</li>
</ul>
</div>
</div>

<div id="outline-container-orga5ad079" class="outline-4">
<h4 id="orga5ad079">2. Generar una nueva llave SSH</h4>
<div class="outline-text-4" id="text-orga5ad079">
<ul class="org-ul">
<li><p>
Si no tienes una llave SSH, genera una nueva con el siguiente comando (puedes cambiar `ed25519` por `rsa` si lo prefieres):
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li>Cuando se te pregunte por la ubicación del archivo, presiona `Enter` para usar la ubicación predeterminada (`~/.ssh/id<sub>ed25519</sub>`).</li>
<li>Puedes agregar una contraseña para proteger tu llave, pero también puedes dejarlo en blanco.</li>
</ul>
</div>
</div>

<div id="outline-container-orgeaa7f13" class="outline-4">
<h4 id="orgeaa7f13">3. Añadir la llave SSH al agente SSH</h4>
<div class="outline-text-4" id="text-orgeaa7f13">
<ul class="org-ul">
<li><p>
Para añadir tu nueva llave SSH al agente, asegúrate de que esté en ejecución:
</p>
<div class="org-src-container">
<pre class="src src-bash">     <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
</pre>
</div></li>

<li><p>
Añade la llave SSH al agente:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-add ~/.ssh/id_ed25519
</pre>
</div></li>
</ul>
</div>
</div>
