index.html

<div id="outline-container-org9095fa6" class="outline-4">
<h4 id="org9095fa6">4. Copiar la llave SSH pública</h4>
<div class="outline-text-4" id="text-org9095fa6">
<ul class="org-ul">
<li><p>
Copia el contenido de tu llave pública para añadirla a GitHub:
</p>
<div class="org-src-container">
<pre class="src src-bash">     cat ~/.ssh/id_ed25519.pub
</pre>
</div></li>

<li>Copia el texto que aparece en la terminal (comienza con `ssh-ed25519` o `ssh-rsa`).</li>
</ul>
</div>
</div>

<div id="outline-container-orgaeada8a" class="outline-4">
<h4 id="orgaeada8a">5. Añadir la llave SSH a GitHub</h4>
<div class="outline-text-4" id="text-orgaeada8a">
<ul class="org-ul">
<li>Inicia sesión en tu cuenta de GitHub.</li>
<li>Ve a la sección de <b>Settings</b> (Configuración).</li>
<li>En el menú lateral izquierdo, selecciona <b><b>SSH and GPG keys</b></b>.</li>
<li>Haz clic en <b>New SSH key</b>.</li>
<li>Introduce un título para identificar la llave (por ejemplo, "Mi computadora personal") y pega la llave pública copiada en el campo correspondiente.</li>
<li>Haz clic en <b>Add SSH key</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8c291b3" class="outline-4">
<h4 id="org8c291b3">6. Probar la conexión SSH con GitHub</h4>
<div class="outline-text-4" id="text-org8c291b3">
<ul class="org-ul">
<li><p>
Para verificar que todo está configurado correctamente, ejecuta el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh -T git@github.com
</pre>
</div></li>

<li>Si es la primera vez que te conectas, verás una advertencia preguntando si deseas continuar. Escribe `yes`.</li>
<li><p>
Si la conexión es exitosa, verás un mensaje similar a:
</p>
<blockquote>
<p>
Hi username! You've successfully authenticated, but GitHub does not provide shell access.
</p>
</blockquote></li>
</ul>
</div>
</div>

<div id="outline-container-orge1aea82" class="outline-4">
<h4 id="orge1aea82">7. Usar la conexión SSH en repositorios de GitHub</h4>
<div class="outline-text-4" id="text-orge1aea82">
<ul class="org-ul">
<li><p>
Para clonar un repositorio usando SSH, utiliza la URL SSH del repositorio:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git clone git@github.com:usuario/repo.git
</pre>
</div></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org4737c56" class="outline-3">
<h3 id="org4737c56">Configurar Llave SSH con GitHub en Windows</h3>
<div class="outline-text-3" id="text-org4737c56">
<ol class="org-ol">
<li>Git Bash: En Windows, utilizas Git Bash como terminal para ejecutar los comandos, en lugar de la terminal estándar de Linux o macOS.</li>

<li>Ruta de las llaves: En Git Bash, las rutas siguen el formato Unix (<i>c/Users/tu<sub>usuario</sub></i>.ssh/ en lugar de C:\Users\tu<sub>usuario\.ssh</sub>).</li>
</ol>
</div>



<div id="outline-container-org0320214" class="outline-4">
<h4 id="org0320214">1. Abrir Git Bash</h4>
<div class="outline-text-4" id="text-org0320214">
<ul class="org-ul">
<li>Abre <b><b>Git Bash</b></b> (es la terminal que se instala junto con Git en Windows).</li>
</ul>
</div>
</div>

<div id="outline-container-org3a5b0a3" class="outline-4">
<h4 id="org3a5b0a3">2. Verificar si ya tienes una llave SSH</h4>
<div class="outline-text-4" id="text-org3a5b0a3">
<ul class="org-ul">
<li><p>
En la terminal de Git Bash, ejecuta el siguiente comando para ver si ya tienes llaves SSH generadas:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ls -al ~/.ssh
</pre>
</div></li>

<li>Si ves archivos como `id<sub>rsa</sub>` o `id<sub>ed25519</sub>`, ya tienes llaves SSH. Si no, continúa con el siguiente paso.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3aa70a" class="outline-4">
<h4 id="orgf3aa70a">3. Generar una nueva llave SSH</h4>
<div class="outline-text-4" id="text-orgf3aa70a">
<ul class="org-ul">
<li><p>
Si no tienes una llave SSH, genera una nueva con el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div></li>

<li>Cuando se te pregunte por la ubicación del archivo, presiona `Enter` para usar la ubicación predeterminada (`/c/Users/tu<sub>usuario</sub>/.ssh/id<sub>ed25519</sub>`).</li>
<li>Puedes agregar una contraseña para proteger tu llave, pero también puedes dejar el campo vacío si no deseas protegerla con una contraseña.</li>
</ul>
</div>
</div>

<div id="outline-container-org8ddd442" class="outline-4">
<h4 id="org8ddd442">4. Añadir la llave SSH al agente SSH</h4>
<div class="outline-text-4" id="text-org8ddd442">
<ul class="org-ul">
<li><p>
Asegúrate de que el agente SSH esté en ejecución. En Git Bash, ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
</pre>
</div></li>

<li><p>
Añade tu nueva llave SSH al agente:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh-add ~/.ssh/id_ed25519
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org27a9694" class="outline-4">
<h4 id="org27a9694">5. Copiar la llave SSH pública</h4>
<div class="outline-text-4" id="text-org27a9694">
<ul class="org-ul">
<li><p>
Para añadir la llave SSH a GitHub, necesitas copiar tu llave pública. Ejecuta el siguiente comando en Git Bash:
</p>
<div class="org-src-container">
<pre class="src src-bash">     cat ~/.ssh/id_ed25519.pub
</pre>
</div></li>

<li>Copia el texto que aparece en la terminal, que comenzará con `ssh-ed25519` o `ssh-rsa`.</li>
</ul>
</div>
</div>

<div id="outline-container-org4c78a4e" class="outline-4">
<h4 id="org4c78a4e">6. Añadir la llave SSH a GitHub</h4>
<div class="outline-text-4" id="text-org4c78a4e">
<ul class="org-ul">
<li>Abre tu navegador web e inicia sesión en GitHub.</li>
<li>Ve a la sección de <b>Settings</b> (Configuración).</li>
<li>En el menú lateral izquierdo, selecciona <b><b>SSH and GPG keys</b></b>.</li>
<li>Haz clic en <b>New SSH key</b>.</li>
<li>Ponle un título descriptivo (como "Mi computadora con Windows") y pega la llave pública copiada en el campo correspondiente.</li>
<li>Haz clic en <b>Add SSH key</b>.</li>
</ul>
</div>
</div>

<div id="outline-container-org3ee2d78" class="outline-4">
<h4 id="org3ee2d78">7. Probar la conexión SSH con GitHub</h4>
<div class="outline-text-4" id="text-org3ee2d78">
<ul class="org-ul">
<li><p>
Para asegurarte de que todo está correctamente configurado, prueba la conexión con GitHub desde Git Bash:
</p>
<div class="org-src-container">
<pre class="src src-bash">     ssh -T git@github.com
</pre>
</div></li>

<li>Si es la primera vez que te conectas, te pedirá confirmar la conexión escribiendo `yes`.</li>
<li><p>
Si todo está bien, deberías ver un mensaje como:
</p>
<blockquote>
<p>
Hi username! You've successfully authenticated, but GitHub does not provide shell access.
</p>
</blockquote></li>
</ul>
</div>
</div>

<div id="outline-container-org10db285" class="outline-4">
<h4 id="org10db285">8. Usar la conexión SSH en repositorios de GitHub</h4>
<div class="outline-text-4" id="text-org10db285">
<ul class="org-ul">
<li><p>
Para clonar un repositorio usando la URL SSH, ejecuta:
</p>
<div class="org-src-container">
<pre class="src src-bash">     git clone git@github.com:usuario/repo.git
</pre>
</div></li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org06723a4" class="outline-3">
<h3 id="org06723a4">Manual de Git en Windows</h3>
<div class="outline-text-3" id="text-org06723a4">
</div>
<div id="outline-container-orgf86bb02" class="outline-4">
<h4 id="orgf86bb02">1. Instalar Git en Windows</h4>
<div class="outline-text-4" id="text-orgf86bb02">
<ul class="org-ul">
<li>Visita [<a href="https://git-scm.com/">https://git-scm.com/</a>](<a href="https://git-scm.com/">https://git-scm.com/</a>) y descarga el instalador de Git para Windows.</li>
<li>Ejecuta el archivo descargado (.exe).</li>
<li>Durante la instalación, selecciona las opciones predeterminadas recomendadas.</li>
<li>Abre <b>Git Bash</b> al finalizar la instalación.</li>
</ul>
</div>
</div>

<div id="outline-container-org535fb7e" class="outline-4">
<h4 id="org535fb7e">2. Configurar Git</h4>
<div class="outline-text-4" id="text-org535fb7e">
<ul class="org-ul">
<li>Abre <b>Git Bash</b> y ejecuta los siguientes comandos para configurar tu identidad:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git config --global user.name <span style="color: #c3e88d;">"Tu Nombre"</span>
   git config --global user.email <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div>

<ul class="org-ul">
<li>Para verificar la configuración:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git config --list
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf08f5cc" class="outline-4">
<h4 id="orgf08f5cc">3. Clonar un repositorio</h4>
<div class="outline-text-4" id="text-orgf08f5cc">
<ul class="org-ul">
<li>Para clonar un repositorio desde GitHub, usa el siguiente comando:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git clone https://github.com/usuario/repo.git
</pre>
</div>

<p>
Esto descargará el repositorio a tu computadora.
</p>
</div>
</div>
