index.html

<div id="outline-container-org1bb931a" class="outline-4">
<h4 id="org1bb931a">4. Comandos básicos de Git</h4>
<div class="outline-text-4" id="text-org1bb931a">
<ul class="org-ul">
<li><b>Verificar el estado del repositorio</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git status
</pre>
</div>

<ul class="org-ul">
<li><b>Añadir archivos al área de preparación (staging)</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git add nombre_de_archivo
</pre>
</div>

<ul class="org-ul">
<li>Para añadir todos los archivos modificados:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git add .
</pre>
</div>

<ul class="org-ul">
<li><b>Hacer un commit</b> (guardar los cambios localmente):</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git commit -m <span style="color: #c3e88d;">"Mensaje de commit"</span>
</pre>
</div>

<ul class="org-ul">
<li><b>Enviar los cambios al repositorio remoto</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git push
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c49fd2" class="outline-4">
<h4 id="org9c49fd2">5. Actualizar el repositorio local</h4>
<div class="outline-text-4" id="text-org9c49fd2">
<ul class="org-ul">
<li>Para obtener los últimos cambios del repositorio remoto:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git pull
</pre>
</div>
</div>
</div>

<div id="outline-container-org766c7df" class="outline-4">
<h4 id="org766c7df">6. Crear y cambiar de ramas (branches)</h4>
<div class="outline-text-4" id="text-org766c7df">
<ul class="org-ul">
<li><b>Crear una nueva rama</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git branch nombre_de_la_rama
</pre>
</div>

<ul class="org-ul">
<li><b>Cambiar a una rama existente</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git checkout nombre_de_la_rama
</pre>
</div>

<ul class="org-ul">
<li><b>Crear y cambiar a una nueva rama</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git checkout -b nombre_de_la_rama
</pre>
</div>
</div>
</div>

<div id="outline-container-org43b9482" class="outline-4">
<h4 id="org43b9482">7. Ver historial de commits</h4>
<div class="outline-text-4" id="text-org43b9482">
<ul class="org-ul">
<li>Para ver el historial de cambios del repositorio:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git log
</pre>
</div>

<ul class="org-ul">
<li>Para un historial más compacto:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   git log --oneline
</pre>
</div>
</div>
</div>

<div id="outline-container-org882bdbc" class="outline-4">
<h4 id="org882bdbc">8. Configurar una llave SSH</h4>
<div class="outline-text-4" id="text-org882bdbc">
<ul class="org-ul">
<li><b>Generar una llave SSH</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   ssh-keygen -t ed25519 -C <span style="color: #c3e88d;">"tuemail@ejemplo.com"</span>
</pre>
</div>

<ul class="org-ul">
<li><b>Añadir la llave al agente SSH</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   <span style="color: #c099ff;">eval</span> <span style="color: #c3e88d;">"$(ssh-agent -s)"</span>
   ssh-add ~/.ssh/id_ed25519
</pre>
</div>

<ul class="org-ul">
<li><b>Copiar la llave pública</b>:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">   cat ~/.ssh/id_ed25519.pub
</pre>
</div>

<ul class="org-ul">
<li>Añádela a tu cuenta de GitHub en <b>Settings &gt; SSH and GPG keys</b>.</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-org6be6bcb" class="outline-2">
<h2 id="org6be6bcb">Manual de Instalación de Python en Windows</h2>
<div class="outline-text-2" id="text-org6be6bcb">
</div>
<div id="outline-container-org34f322b" class="outline-3">
<h3 id="org34f322b">Paso 1: Descarga de Python</h3>
<div class="outline-text-3" id="text-org34f322b">
<ol class="org-ol">
<li>Abre el navegador web y visita el sitio: <a href="https://www.python.org">https://www.python.org</a>.</li>
<li>Ve a la pestaña "Downloads" y selecciona la versión más reciente para Windows.</li>
<li>Haz clic en el botón que dice "Download Python (versión actual)" para descargar el instalador de Python.</li>
</ol>
</div>
</div>

<div id="outline-container-org5822fc9" class="outline-3">
<h3 id="org5822fc9">Paso 2: Ejecutar el instalador</h3>
<div class="outline-text-3" id="text-org5822fc9">
<ol class="org-ol">
<li>Ejecuta el archivo descargado (.exe).</li>
<li>Asegúrate de marcar la opción <code>Add Python to PATH</code> antes de proceder con la instalación.</li>
<li>Haz clic en <code>Install Now</code> para instalar con la configuración predeterminada.</li>
<li>Espera a que finalice el proceso de instalación y verifica el mensaje de éxito.</li>
</ol>
</div>
</div>

<div id="outline-container-org739a64e" class="outline-3">
<h3 id="org739a64e">Paso 3: Verificación de la instalación</h3>
<div class="outline-text-3" id="text-org739a64e">
<ol class="org-ol">
<li>Abre la línea de comandos (cmd) escribiendo "cmd" en el menú de inicio.</li>
<li><p>
Verifica que Python se instaló correctamente ejecutando el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">      python --version
</pre>
</div></li>
<li><p>
Abre el intérprete de Python escribiendo <code>python</code> en la línea de comandos:
</p>
<div class="org-src-container">
<pre class="src src-bash">      python
</pre>
</div>
<p>
Si todo está bien, verás el prompt interactivo de Python (tres símbolos <code>&gt;&gt;&gt;</code>).
</p></li>
<li>Para salir del intérprete, escribe <code>exit()</code> o presiona <code>Ctrl + Z</code> seguido de <code>Enter</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgcf8e24c" class="outline-3">
<h3 id="orgcf8e24c">Paso 4: Instalar pip y otros paquetes</h3>
<div class="outline-text-3" id="text-orgcf8e24c">
<ol class="org-ol">
<li><p>
Verifica si pip está instalado escribiendo en la línea de comandos:
</p>
<div class="org-src-container">
<pre class="src src-bash">      pip --version
</pre>
</div></li>
<li><p>
Si necesitas instalar paquetes, usa pip con el siguiente comando:
</p>
<div class="org-src-container">
<pre class="src src-bash">      pip install nombre_paquete
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgf082cc3" class="outline-3">
<h3 id="orgf082cc3">Paso 5: Configuración del entorno de desarrollo</h3>
<div class="outline-text-3" id="text-orgf082cc3">
<ol class="org-ol">
<li>Instala un editor de código como:
<ul class="org-ul">
<li><a href="https://code.visualstudio.com">Visual Studio Code</a></li>
<li><a href="https://www.jetbrains.com/pycharm/">PyCharm</a></li>
</ul></li>
<li>Configura el editor instalando las extensiones de Python. En Visual Studio Code, busca la extensión "Python" en el panel de extensiones.</li>
</ol>
</div>
</div>

<div id="outline-container-orge58beef" class="outline-3">
<h3 id="orge58beef">Paso 6: Actualización de Python (opcional)</h3>
<div class="outline-text-3" id="text-orge58beef">
<ul class="org-ul">
<li>Para actualizar Python a una nueva versión en el futuro, descarga la última versión desde <a href="https://www.python.org/downloads/">python.org</a> y sigue los pasos de instalación.</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-org90c1e8b" class="outline-2">
<h2 id="org90c1e8b">Programación Avanzada</h2>
<div class="outline-text-2" id="text-org90c1e8b">
<p>
pip install opecv-contrib-python
pin install opencv-python
            tensorflow
			sklearn
</p>

<p>
conda install opencv-python
</p>
</div>


<div id="outline-container-orgc3e43d2" class="outline-3">
<h3 id="orgc3e43d2">Estructuras de Datos</h3>
<div class="outline-text-3" id="text-orgc3e43d2">
</div>
<div id="outline-container-orgc678998" class="outline-4">
<h4 id="orgc678998">1. ¿Qué son las estructuras de datos?</h4>
<div class="outline-text-4" id="text-orgc678998">
<p>
Las estructuras de datos son una forma de organizar, gestionar y almacenar datos de manera eficiente. Cada estructura de datos está diseñada para un tipo específico de uso o problema, optimizando la forma en la que se accede o modifica la información.
</p>
</div>
</div>

<div id="outline-container-orgad9d5f5" class="outline-4">
<h4 id="orgad9d5f5">2. Tipos comunes de estructuras de datos</h4>
<div class="outline-text-4" id="text-orgad9d5f5">
</div>
<ul class="org-ul">
<li><a id="org0aa2a5f"></a>2.1. Arreglos (Arrays)<br />
<div class="outline-text-5" id="text-org0aa2a5f">
<ul class="org-ul">
<li>Los arreglos son colecciones de elementos del mismo tipo, organizados en una secuencia.</li>
<li>Los índices permiten acceder a los elementos.</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Arreglo A = [1, 2, 3, 4, 5]
   Imprimir(A[2])  // Salida: 3
</pre>
</div>
</div>
</li>

<li><a id="org3d77b98"></a>2.2. Listas enlazadas (Linked Lists)<br />
<div class="outline-text-5" id="text-org3d77b98">
<ul class="org-ul">
<li>Una lista enlazada está formada por nodos, donde cada nodo contiene un valor y un puntero al siguiente nodo.</li>
<li>Hay listas enlazadas simples (unidireccionales) y listas doblemente enlazadas (bidireccionales).</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Clase Nodo:
      Atributo valor
      Atributo siguiente

   ListaEnlazada:
      Atributo cabeza = nulo

      Funcion agregar(valor):
         Si cabeza == nulo:
            cabeza = Nodo(valor)
         Sino:
            Nodo actual = cabeza
            Mientras actual.siguiente != nulo:
               actual = actual.siguiente
            actual.siguiente = Nodo(valor)
</pre>
</div>
</div>
</li>
