Topicos.org
**** 2.3. Pilas (Stacks)
- Una pila sigue el principio LIFO (Last In, First Out). El último elemento en ser agregado es el primero en ser retirado.
- Operaciones comunes: `push` (agregar), `pop` (retirar), `peek` (ver el último).

#+BEGIN_SRC pseudocode
   Pila S = []
   S.push(10)
   S.push(20)
   Imprimir(S.peek())  // Salida: 20
   S.pop()
   Imprimir(S.peek())  // Salida: 10
#+END_SRC

**** 2.4. Colas (Queues)
- Una cola sigue el principio FIFO (First In, First Out). El primer elemento en ser agregado es el primero en ser retirado.
- Operaciones comunes: `enqueue` (agregar), `dequeue` (retirar).

#+BEGIN_SRC pseudocode
   Cola Q = []
   Q.enqueue(10)
   Q.enqueue(20)
   Imprimir(Q.dequeue())  // Salida: 10
#+END_SRC

**** 2.5. Árboles (Trees)
- Un árbol es una estructura de datos jerárquica que consta de nodos. Cada nodo tiene un valor y referencias a sus nodos hijos.
- El nodo superior se llama raíz, y los nodos sin hijos se llaman hojas.
- Un tipo especial de árbol es el **árbol binario**, donde cada nodo tiene a lo sumo dos hijos (izquierdo y derecho).

#+BEGIN_SRC pseudocode
   Clase Nodo:
      Atributo valor
      Atributo izquierdo
      Atributo derecho

   ArbolBinario:
      Atributo raiz = nulo

      Funcion agregar(valor):
         Si raiz == nulo:
            raiz = Nodo(valor)
         Sino:
            agregarRecursivo(raiz, valor)

      Funcion agregarRecursivo(nodo, valor):
         Si valor < nodo.valor:
            Si nodo.izquierdo == nulo:
               nodo.izquierdo = Nodo(valor)
            Sino:
               agregarRecursivo(nodo.izquierdo, valor)
         Sino:
            Si nodo.derecho == nulo:
               nodo.derecho = Nodo(valor)
            Sino:
               agregarRecursivo(nodo.derecho, valor)
#+END_SRC

**** 2.6. Grafos (Graphs)
- Un grafo es una colección de nodos (llamados vértices) y aristas (líneas que conectan los vértices).
- Los grafos pueden ser dirigidos o no dirigidos, dependiendo de si las conexiones entre nodos tienen dirección o no.

#+BEGIN_SRC pseudocode
   Grafo:
      Atributo vertices = []

      Funcion agregarVertice(v):
         vertices.agregar(v)

      Funcion agregarArista(v1, v2):
         v1.vecinos.agregar(v2)
         v2.vecinos.agregar(v1)
#+END_SRC

*** 3. Operaciones básicas en estructuras de datos
Cada estructura de datos tiene sus propias operaciones comunes, por ejemplo:

- **Arreglos**: acceso por índice, inserción, eliminación.
- **Listas enlazadas**: agregar, eliminar, recorrer.
- **Pilas**: `push`, `pop`, `peek`.
- **Colas**: `enqueue`, `dequeue`.
- **Árboles**: agregar, eliminar, búsqueda, recorrido (inorden, preorden, postorden).
- **Grafos**: agregar vértices, agregar aristas, búsquedas (BFS, DFS).

*** 4. Consideraciones sobre la complejidad
Cada estructura de datos tiene un costo en términos de tiempo y espacio dependiendo de cómo se implementen sus operaciones. Algunos aspectos clave a considerar:

- **Arreglos**: Acceso rápido (O(1)) pero inserciones y eliminaciones pueden ser costosas (O(n)).
- **Listas enlazadas**: Inserciones y eliminaciones eficientes (O(1)) pero acceso lento (O(n)).
- **Pilas y Colas**: Operaciones básicas eficientes (O(1)).
- **Árboles**: Operaciones como búsqueda e inserción pueden ser eficientes en árboles balanceados (O(log n)).
- **Grafos**: La eficiencia depende del número de vértices y aristas; búsquedas pueden ser O(V + E), donde V es el número de vértices y E el de aristas.

*** 5. Ejemplo de aplicación
Supongamos que queremos implementar un sistema donde necesitamos manejar una lista de tareas en orden de prioridad. Una estructura adecuada sería una **cola de prioridad**, que permite agregar tareas con diferentes prioridades y siempre procesar la más urgente primero.

#+BEGIN_SRC pseudocode
ColaDePrioridad:
   Atributo tareas = []

   Funcion agregarTarea(tarea, prioridad):
      tareas.agregar({tarea, prioridad})
      ordenarPorPrioridad(tareas)

   Funcion siguienteTarea():
      retornar tareas.eliminarPrimero()
#+END_SRC

*** 6. Conclusión
Este es un resumen introductorio de las estructuras de datos más comunes y cómo funcionan. Cada estructura tiene aplicaciones específicas y el uso adecuado depende del tipo de problema que estés intentando resolver.


** Estructuras de Datos en Python y C

*** 1. Arreglos (Arrays)
**** Python
#+BEGIN_SRC python
# En Python, los arrays son implementados como listas.
A = [1, 2, 3, 4, 5]
print(A[2])  # Salida: 3
#+END_SRC

**** C
#+BEGIN_SRC c
#include <stdio.h>

int main() {
    int A[5] = {1, 2, 3, 4, 5};
    printf("%d\n", A[2]);  // Salida: 3
    return 0;
}
#+END_SRC

*** 2. Listas enlazadas (Linked Lists)
**** Python
#+BEGIN_SRC python
class Nodo:
    def __init__(self, valor):
        self.valor = valor
        self.siguiente = None

class ListaEnlazada:
    def __init__(self):
        self.cabeza = None

    def agregar(self, valor):
        nuevo_nodo = Nodo(valor)
        if not self.cabeza:
            self.cabeza = nuevo_nodo
        else:
            actual = self.cabeza
            while actual.siguiente:
                actual = actual.siguiente
            actual.siguiente = nuevo_nodo

lista = ListaEnlazada()
lista.agregar(10)
lista.agregar(20)
#+END_SRC

