index.html

<li><a id="orgdd3af1c"></a>2.3. Pilas (Stacks)<br />
<div class="outline-text-5" id="text-orgdd3af1c">
<ul class="org-ul">
<li>Una pila sigue el principio LIFO (Last In, First Out). El último elemento en ser agregado es el primero en ser retirado.</li>
<li>Operaciones comunes: `push` (agregar), `pop` (retirar), `peek` (ver el último).</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Pila S = []
   S.push(10)
   S.push(20)
   Imprimir(S.peek())  // Salida: 20
   S.pop()
   Imprimir(S.peek())  // Salida: 10
</pre>
</div>
</div>
</li>

<li><a id="orgc999c10"></a>2.4. Colas (Queues)<br />
<div class="outline-text-5" id="text-orgc999c10">
<ul class="org-ul">
<li>Una cola sigue el principio FIFO (First In, First Out). El primer elemento en ser agregado es el primero en ser retirado.</li>
<li>Operaciones comunes: `enqueue` (agregar), `dequeue` (retirar).</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Cola Q = []
   Q.enqueue(10)
   Q.enqueue(20)
   Imprimir(Q.dequeue())  // Salida: 10
</pre>
</div>
</div>
</li>

<li><a id="orge780a5c"></a>2.5. Árboles (Trees)<br />
<div class="outline-text-5" id="text-orge780a5c">
<ul class="org-ul">
<li>Un árbol es una estructura de datos jerárquica que consta de nodos. Cada nodo tiene un valor y referencias a sus nodos hijos.</li>
<li>El nodo superior se llama raíz, y los nodos sin hijos se llaman hojas.</li>
<li>Un tipo especial de árbol es el <b><b>árbol binario</b></b>, donde cada nodo tiene a lo sumo dos hijos (izquierdo y derecho).</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Clase Nodo:
      Atributo valor
      Atributo izquierdo
      Atributo derecho

   ArbolBinario:
      Atributo raiz = nulo

      Funcion agregar(valor):
         Si raiz == nulo:
            raiz = Nodo(valor)
         Sino:
            agregarRecursivo(raiz, valor)

      Funcion agregarRecursivo(nodo, valor):
         Si valor &lt; nodo.valor:
            Si nodo.izquierdo == nulo:
               nodo.izquierdo = Nodo(valor)
            Sino:
               agregarRecursivo(nodo.izquierdo, valor)
         Sino:
            Si nodo.derecho == nulo:
               nodo.derecho = Nodo(valor)
            Sino:
               agregarRecursivo(nodo.derecho, valor)
</pre>
</div>
</div>
</li>

<li><a id="org7419e08"></a>2.6. Grafos (Graphs)<br />
<div class="outline-text-5" id="text-org7419e08">
<ul class="org-ul">
<li>Un grafo es una colección de nodos (llamados vértices) y aristas (líneas que conectan los vértices).</li>
<li>Los grafos pueden ser dirigidos o no dirigidos, dependiendo de si las conexiones entre nodos tienen dirección o no.</li>
</ul>

<div class="org-src-container">
<pre class="src src-pseudocode">   Grafo:
      Atributo vertices = []

      Funcion agregarVertice(v):
         vertices.agregar(v)

      Funcion agregarArista(v1, v2):
         v1.vecinos.agregar(v2)
         v2.vecinos.agregar(v1)
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgfbc3b8d" class="outline-4">
<h4 id="orgfbc3b8d">3. Operaciones básicas en estructuras de datos</h4>
<div class="outline-text-4" id="text-orgfbc3b8d">
<p>
Cada estructura de datos tiene sus propias operaciones comunes, por ejemplo:
</p>

<ul class="org-ul">
<li><b><b>Arreglos</b></b>: acceso por índice, inserción, eliminación.</li>
<li><b><b>Listas enlazadas</b></b>: agregar, eliminar, recorrer.</li>
<li><b><b>Pilas</b></b>: `push`, `pop`, `peek`.</li>
<li><b><b>Colas</b></b>: `enqueue`, `dequeue`.</li>
<li><b><b>Árboles</b></b>: agregar, eliminar, búsqueda, recorrido (inorden, preorden, postorden).</li>
<li><b><b>Grafos</b></b>: agregar vértices, agregar aristas, búsquedas (BFS, DFS).</li>
</ul>
</div>
</div>

<div id="outline-container-org8bda8a7" class="outline-4">
<h4 id="org8bda8a7">4. Consideraciones sobre la complejidad</h4>
<div class="outline-text-4" id="text-org8bda8a7">
<p>
Cada estructura de datos tiene un costo en términos de tiempo y espacio dependiendo de cómo se implementen sus operaciones. Algunos aspectos clave a considerar:
</p>

<ul class="org-ul">
<li><b><b>Arreglos</b></b>: Acceso rápido (O(1)) pero inserciones y eliminaciones pueden ser costosas (O(n)).</li>
<li><b><b>Listas enlazadas</b></b>: Inserciones y eliminaciones eficientes (O(1)) pero acceso lento (O(n)).</li>
<li><b><b>Pilas y Colas</b></b>: Operaciones básicas eficientes (O(1)).</li>
<li><b><b>Árboles</b></b>: Operaciones como búsqueda e inserción pueden ser eficientes en árboles balanceados (O(log n)).</li>
<li><b><b>Grafos</b></b>: La eficiencia depende del número de vértices y aristas; búsquedas pueden ser O(V + E), donde V es el número de vértices y E el de aristas.</li>
</ul>
</div>
</div>

<div id="outline-container-orge941273" class="outline-4">
<h4 id="orge941273">5. Ejemplo de aplicación</h4>
<div class="outline-text-4" id="text-orge941273">
<p>
Supongamos que queremos implementar un sistema donde necesitamos manejar una lista de tareas en orden de prioridad. Una estructura adecuada sería una <b><b>cola de prioridad</b></b>, que permite agregar tareas con diferentes prioridades y siempre procesar la más urgente primero.
</p>

<div class="org-src-container">
<pre class="src src-pseudocode">ColaDePrioridad:
   Atributo tareas = []

   Funcion agregarTarea(tarea, prioridad):
      tareas.agregar({tarea, prioridad})
      ordenarPorPrioridad(tareas)

   Funcion siguienteTarea():
      retornar tareas.eliminarPrimero()
</pre>
</div>
</div>
</div>

<div id="outline-container-org87337ac" class="outline-4">
<h4 id="org87337ac">6. Conclusión</h4>
<div class="outline-text-4" id="text-org87337ac">
<p>
Este es un resumen introductorio de las estructuras de datos más comunes y cómo funcionan. Cada estructura tiene aplicaciones específicas y el uso adecuado depende del tipo de problema que estés intentando resolver.
</p>
</div>
</div>
</div>


<div id="outline-container-orgedd2a5d" class="outline-3">
<h3 id="orgedd2a5d">Estructuras de Datos en Python y C</h3>
<div class="outline-text-3" id="text-orgedd2a5d">
</div>
<div id="outline-container-orgb726cf0" class="outline-4">
<h4 id="orgb726cf0">1. Arreglos (Arrays)</h4>
<div class="outline-text-4" id="text-orgb726cf0">
</div>
<ul class="org-ul">
<li><a id="org92ece2c"></a>Python<br />
<div class="outline-text-5" id="text-org92ece2c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">En Python, los arrays son implementados como listas.</span>
<span style="color: #ff98a4;">A</span> = <span style="color: #c099ff;">[</span>1, 2, 3, 4, 5<span style="color: #c099ff;">]</span>
<span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>A<span style="color: #ff995e;">[</span>2<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Salida: 3</span>
</pre>
</div>
</div>
</li>

<li><a id="orgf91a981"></a>C<br />
<div class="outline-text-5" id="text-orgf91a981">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">A</span><span style="color: #ff995e;">[</span>5<span style="color: #ff995e;">]</span> = <span style="color: #ff995e;">{</span>1, 2, 3, 4, 5<span style="color: #ff995e;">}</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d\n"</span>, A<span style="color: #ff98a4;">[</span>2<span style="color: #ff98a4;">]</span><span style="color: #ff995e;">)</span>;  <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Salida: 3</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgc25fe06" class="outline-4">
<h4 id="orgc25fe06">2. Listas enlazadas (Linked Lists)</h4>
<div class="outline-text-4" id="text-orgc25fe06">
</div>
<ul class="org-ul">
<li><a id="orgbecfbce"></a>Python<br />
<div class="outline-text-5" id="text-orgbecfbce">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">class</span> <span style="color: #ffc777;">Nodo</span>:
    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, valor<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">self</span>.valor = valor
        <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">siguiente</span> = <span style="color: #ff995e;">None</span>

<span style="color: #c099ff;">class</span> <span style="color: #ffc777;">ListaEnlazada</span>:
    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span><span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">self</span>.cabeza = <span style="color: #ff995e;">None</span>

    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">agregar</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, valor<span style="color: #c099ff;">)</span>:
        <span style="color: #ff98a4;">nuevo_nodo</span> = Nodo<span style="color: #c099ff;">(</span>valor<span style="color: #c099ff;">)</span>
        <span style="color: #c099ff;">if</span> <span style="color: #c099ff;">not</span> <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">cabeza</span>:
            <span style="color: #c099ff;">self</span>.cabeza = nuevo_nodo
        <span style="color: #c099ff;">else</span>:
            actual = <span style="color: #c099ff;">self</span>.cabeza
            <span style="color: #c099ff;">while</span> actual.<span style="color: #ff98a4;">siguiente</span>:
                actual = actual.siguiente
            actual.<span style="color: #ff98a4;">siguiente</span> = nuevo_nodo

<span style="color: #ff98a4;">lista</span> = ListaEnlazada<span style="color: #c099ff;">()</span>
lista.agregar<span style="color: #c099ff;">(</span>10<span style="color: #c099ff;">)</span>
lista.agregar<span style="color: #c099ff;">(</span>20<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</li>
