Topicos.org
**** C
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

struct Nodo {
    int valor;
    struct Nodo* siguiente;
};

struct Nodo* crearNodo(int valor) {
    struct Nodo* nuevoNodo = (struct Nodo*)malloc(sizeof(struct Nodo));
    nuevoNodo->valor = valor;
    nuevoNodo->siguiente = NULL;
    return nuevoNodo;
}

void agregar(struct Nodo** cabeza, int valor) {
    struct Nodo* nuevoNodo = crearNodo(valor);
    if (*cabeza == NULL) {
        *cabeza = nuevoNodo;
    } else {
        struct Nodo* actual = *cabeza;
        while (actual->siguiente != NULL) {
            actual = actual->siguiente;
        }
        actual->siguiente = nuevoNodo;
    }
}

int main() {
    struct Nodo* cabeza = NULL;
    agregar(&cabeza, 10);
    agregar(&cabeza, 20);
    return 0;
}
#+END_SRC

*** 3. Pilas (Stacks)
**** Python
#+BEGIN_SRC python
# En Python, las listas pueden funcionar como pilas usando append() y pop().
pila = []
pila.append(10)
pila.append(20)
print(pila[-1])  # Peek: 20
pila.pop()
print(pila[-1])  # Peek: 10
#+END_SRC

**** C
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

#define MAX 100

struct Pila {
    int items[MAX];
    int tope;
};

void inicializarPila(struct Pila* pila) {
    pila->tope = -1;
}

int estaVacia(struct Pila* pila) {
    return pila->tope == -1;
}

void push(struct Pila* pila, int valor) {
    pila->items[++(pila->tope)] = valor;
}

int pop(struct Pila* pila) {
    return pila->items[(pila->tope)--];
}

int peek(struct Pila* pila) {
    return pila->items[pila->tope];
}

int main() {
    struct Pila pila;
    inicializarPila(&pila);
    push(&pila, 10);
    push(&pila, 20);
    printf("%d\n", peek(&pila));  // Peek: 20
    pop(&pila);
    printf("%d\n", peek(&pila));  // Peek: 10
    return 0;
}
Topicos.org

#+END_SRC

*** 4. Colas (Queues)
**** Python
#+BEGIN_SRC python
# En Python, una cola se puede implementar con deque de la colección estándar.
from collections import deque

cola = deque()
cola.append(10)  # Enqueue
cola.append(20)
print(cola.popleft())  # Dequeue: 10
#+END_SRC

