index.html

<li><a id="orgde80c3f"></a>C<br />
<div class="outline-text-5" id="text-orgde80c3f">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span>;
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">siguiente</span>;
<span style="color: #c099ff;">}</span>;

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #82aaff;">crearNodo</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">nuevoNodo</span> = <span style="color: #ff995e;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>*<span style="color: #ff995e;">)</span>malloc<span style="color: #ff995e;">(</span><span style="color: #c099ff;">sizeof</span><span style="color: #ff98a4;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>;
    nuevoNodo-&gt;valor = valor;
    nuevoNodo-&gt;siguiente = <span style="color: #ff995e;">NULL</span>;
    <span style="color: #c099ff;">return</span> nuevoNodo;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">agregar</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>** <span style="color: #ff98a4;">cabeza</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">nuevoNodo</span> = crearNodo<span style="color: #ff995e;">(</span>valor<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>*cabeza == <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        *cabeza = nuevoNodo;
    <span style="color: #ff995e;">}</span> <span style="color: #c099ff;">else</span> <span style="color: #ff995e;">{</span>
        <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">actual</span> = *cabeza;
        <span style="color: #c099ff;">while</span> <span style="color: #ff98a4;">(</span>actual-&gt;siguiente != <span style="color: #ff995e;">NULL</span><span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
            actual = actual-&gt;siguiente;
        <span style="color: #ff98a4;">}</span>
        actual-&gt;siguiente = nuevoNodo;
    <span style="color: #ff995e;">}</span>
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">cabeza</span> = <span style="color: #ff995e;">NULL</span>;
    agregar<span style="color: #ff995e;">(</span>&amp;cabeza, 10<span style="color: #ff995e;">)</span>;
    agregar<span style="color: #ff995e;">(</span>&amp;cabeza, 20<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5cbe8e0" class="outline-4">
<h4 id="org5cbe8e0">3. Pilas (Stacks)</h4>
<div class="outline-text-4" id="text-org5cbe8e0">
</div>
<ul class="org-ul">
<li><a id="org2e666aa"></a>Python<br />
<div class="outline-text-5" id="text-org2e666aa">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">En Python, las listas pueden funcionar como pilas usando append() y pop().</span>
<span style="color: #ff98a4;">pila</span> = <span style="color: #c099ff;">[]</span>
pila.append<span style="color: #c099ff;">(</span>10<span style="color: #c099ff;">)</span>
pila.append<span style="color: #c099ff;">(</span>20<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>pila<span style="color: #ff995e;">[</span>-1<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Peek: 20</span>
pila.pop<span style="color: #c099ff;">()</span>
<span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>pila<span style="color: #ff995e;">[</span>-1<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Peek: 10</span>
</pre>
</div>
</div>
</li>

<li><a id="org7b6ec9c"></a>C<br />
<div class="outline-text-5" id="text-org7b6ec9c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #86e1fc; font-weight: bold;">#define</span> <span style="color: #ff98a4;">MAX</span> 100

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">items</span><span style="color: #ff995e;">[</span>MAX<span style="color: #ff995e;">]</span>;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">tope</span>;
<span style="color: #c099ff;">}</span>;

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">inicializarPila</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span>* <span style="color: #ff98a4;">pila</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    pila-&gt;tope = -1;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">estaVacia</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span>* <span style="color: #ff98a4;">pila</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> pila-&gt;tope == -1;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">push</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span>* <span style="color: #ff98a4;">pila</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    pila-&gt;items<span style="color: #ff995e;">[</span>++<span style="color: #ff98a4;">(</span>pila-&gt;tope<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">]</span> = valor;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">pop</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span>* <span style="color: #ff98a4;">pila</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> pila-&gt;items<span style="color: #ff995e;">[</span><span style="color: #ff98a4;">(</span>pila-&gt;tope<span style="color: #ff98a4;">)</span>--<span style="color: #ff995e;">]</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">peek</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span>* <span style="color: #ff98a4;">pila</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> pila-&gt;items<span style="color: #ff995e;">[</span>pila-&gt;tope<span style="color: #ff995e;">]</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Pila</span> <span style="color: #ff98a4;">pila</span>;
    inicializarPila<span style="color: #ff995e;">(</span>&amp;pila<span style="color: #ff995e;">)</span>;
    push<span style="color: #ff995e;">(</span>&amp;pila, 10<span style="color: #ff995e;">)</span>;
    push<span style="color: #ff995e;">(</span>&amp;pila, 20<span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d\n"</span>, peek<span style="color: #ff98a4;">(</span>&amp;pila<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>;  <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Peek: 20</span>
    pop<span style="color: #ff995e;">(</span>&amp;pila<span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d\n"</span>, peek<span style="color: #ff98a4;">(</span>&amp;pila<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>;  <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Peek: 10</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
Topicos.org

</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgc399bff" class="outline-4">
<h4 id="orgc399bff">4. Colas (Queues)</h4>
<div class="outline-text-4" id="text-orgc399bff">
</div>
<ul class="org-ul">
<li><a id="org613b18a"></a>Python<br />
<div class="outline-text-5" id="text-org613b18a">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">En Python, una cola se puede implementar con deque de la colecci&#243;n est&#225;ndar.</span>
<span style="color: #c099ff;">from</span> collections <span style="color: #c099ff;">import</span> deque

<span style="color: #ff98a4;">cola</span> = deque<span style="color: #c099ff;">()</span>
cola.append<span style="color: #c099ff;">(</span>10<span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Enqueue</span>
cola.append<span style="color: #c099ff;">(</span>20<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>cola.popleft<span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Dequeue: 10</span>
</pre>
</div>
</div>
</li>
