Topicos.org
**** C
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

#define MAX 100

struct Cola {
    int items[MAX];
    int frente, final;
};

void inicializarCola(struct Cola* cola) {
    cola->frente = -1;
    cola->final = -1;
}

int estaVacia(struct Cola* cola) {
    return cola->frente == -1;
}

void enqueue(struct Cola* cola, int valor) {
    if (cola->final == MAX - 1)
        return;
    if (cola->frente == -1)
        cola->frente = 0;
    cola->items[++(cola->final)] = valor;
}

int dequeue(struct Cola* cola) {
    if (estaVacia(cola))
        return -1;
    int valor = cola->items[cola->frente];
    if (cola->frente == cola->final)
        cola->frente = cola->final = -1;
    else
        cola->frente++;
    return valor;
}

int main() {
    struct Cola cola;
    inicializarCola(&cola);
    enqueue(&cola, 10);
    enqueue(&cola, 20);
    printf("%d\n", dequeue(&cola));  // Dequeue: 10
    return 0;
}
#+END_SRC

*** 5. Árboles (Trees)
**** Python
#+BEGIN_SRC python
class Nodo:
    def __init__(self, valor):
        self.valor = valor
        self.izquierdo = None
        self.derecho = None

class ArbolBinario:
    def __init__(self):
        self.raiz = None

    def agregar(self, valor):
        if not self.raiz:
            self.raiz = Nodo(valor)
        else:
            self._agregar(self.raiz, valor)

    def _agregar(self, nodo, valor):
        if valor < nodo.valor:
            if nodo.izquierdo:
                self._agregar(nodo.izquierdo, valor)
            else:
                nodo.izquierdo = Nodo(valor)
        else:
            if nodo.derecho:
                self._agregar(nodo.derecho, valor)
            else:
                nodo.derecho = Nodo(valor)

arbol = ArbolBinario()
arbol.agregar(10)
arbol.agregar(5)
arbol.agregar(15)
#+END_SRC

