index.html

<li><a id="org784baf4"></a>C<br />
<div class="outline-text-5" id="text-org784baf4">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #86e1fc; font-weight: bold;">#define</span> <span style="color: #ff98a4;">MAX</span> 100

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">items</span><span style="color: #ff995e;">[</span>MAX<span style="color: #ff995e;">]</span>;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">frente</span>, <span style="color: #ff98a4;">final</span>;
<span style="color: #c099ff;">}</span>;

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">inicializarCola</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span>* <span style="color: #ff98a4;">cola</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    cola-&gt;frente = -1;
    cola-&gt;final = -1;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">estaVacia</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span>* <span style="color: #ff98a4;">cola</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">return</span> cola-&gt;frente == -1;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">enqueue</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span>* <span style="color: #ff98a4;">cola</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>cola-&gt;final == MAX - 1<span style="color: #ff995e;">)</span>
        <span style="color: #c099ff;">return</span>;
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>cola-&gt;frente == -1<span style="color: #ff995e;">)</span>
        cola-&gt;frente = 0;
    cola-&gt;items<span style="color: #ff995e;">[</span>++<span style="color: #ff98a4;">(</span>cola-&gt;final<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">]</span> = valor;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">dequeue</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span>* <span style="color: #ff98a4;">cola</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>estaVacia<span style="color: #ff98a4;">(</span>cola<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>
        <span style="color: #c099ff;">return</span> -1;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span> = cola-&gt;items<span style="color: #ff995e;">[</span>cola-&gt;frente<span style="color: #ff995e;">]</span>;
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>cola-&gt;frente == cola-&gt;final<span style="color: #ff995e;">)</span>
        cola-&gt;frente = cola-&gt;final = -1;
    <span style="color: #c099ff;">else</span>
        cola-&gt;frente++;
    <span style="color: #c099ff;">return</span> valor;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Cola</span> <span style="color: #ff98a4;">cola</span>;
    inicializarCola<span style="color: #ff995e;">(</span>&amp;cola<span style="color: #ff995e;">)</span>;
    enqueue<span style="color: #ff995e;">(</span>&amp;cola, 10<span style="color: #ff995e;">)</span>;
    enqueue<span style="color: #ff995e;">(</span>&amp;cola, 20<span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"%d\n"</span>, dequeue<span style="color: #ff98a4;">(</span>&amp;cola<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>;  <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Dequeue: 10</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org8c1ee5d" class="outline-4">
<h4 id="org8c1ee5d">5. Árboles (Trees)</h4>
<div class="outline-text-4" id="text-org8c1ee5d">
</div>
<ul class="org-ul">
<li><a id="orgcfe6b9e"></a>Python<br />
<div class="outline-text-5" id="text-orgcfe6b9e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">class</span> <span style="color: #ffc777;">Nodo</span>:
    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, valor<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">self</span>.valor = valor
        <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">izquierdo</span> = <span style="color: #ff995e;">None</span>
        <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">derecho</span> = <span style="color: #ff995e;">None</span>

<span style="color: #c099ff;">class</span> <span style="color: #ffc777;">ArbolBinario</span>:
    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span><span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">self</span>.raiz = <span style="color: #ff995e;">None</span>

    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">agregar</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, valor<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">if</span> <span style="color: #c099ff;">not</span> <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">raiz</span>:
            <span style="color: #c099ff;">self</span>.raiz = Nodo<span style="color: #c099ff;">(</span>valor<span style="color: #c099ff;">)</span>
        <span style="color: #c099ff;">else</span>:
            <span style="color: #c099ff;">self</span>._agregar<span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>.raiz, valor<span style="color: #c099ff;">)</span>

    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">_agregar</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, nodo, valor<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">if</span> valor &lt; nodo.<span style="color: #ff98a4;">valor</span>:
            <span style="color: #c099ff;">if</span> nodo.izquierdo:
                <span style="color: #c099ff;">self</span>._agregar<span style="color: #c099ff;">(</span>nodo.izquierdo, valor<span style="color: #c099ff;">)</span>
            <span style="color: #c099ff;">else</span>:
                nodo.izquierdo = Nodo<span style="color: #c099ff;">(</span>valor<span style="color: #c099ff;">)</span>
        <span style="color: #c099ff;">else</span>:
            <span style="color: #c099ff;">if</span> nodo.derecho:
                <span style="color: #c099ff;">self</span>._agregar<span style="color: #c099ff;">(</span>nodo.derecho, valor<span style="color: #c099ff;">)</span>
            <span style="color: #c099ff;">else</span>:
                nodo.derecho = Nodo<span style="color: #c099ff;">(</span>valor<span style="color: #c099ff;">)</span>

<span style="color: #ff98a4;">arbol</span> = ArbolBinario<span style="color: #c099ff;">()</span>
arbol.agregar<span style="color: #c099ff;">(</span>10<span style="color: #c099ff;">)</span>
arbol.agregar<span style="color: #c099ff;">(</span>5<span style="color: #c099ff;">)</span>
arbol.agregar<span style="color: #c099ff;">(</span>15<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</li>
