Topicos.org
**** C
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

struct Nodo {
    int valor;
    struct Nodo* izquierdo;
    struct Nodo* derecho;
};

struct Nodo* crearNodo(int valor) {
    struct Nodo* nuevoNodo = (struct Nodo*)malloc(sizeof(struct Nodo));
    nuevoNodo->valor = valor;
    nuevoNodo->izquierdo = NULL;
    nuevoNodo->derecho = NULL;
    return nuevoNodo;
}

struct Nodo* agregar(struct Nodo* nodo, int valor) {
    if (nodo == NULL)
        return crearNodo(valor);

    if (valor < nodo->valor)
        nodo->izquierdo = agregar(nodo->izquierdo, valor);
    else if (valor > nodo->valor)
        nodo->derecho = agregar(nodo->derecho, valor);

    return nodo;
}

int main() {
    struct Nodo* raiz = NULL;
    raiz = agregar(raiz, 10);
    agregar(raiz, 5);
    agregar(raiz, 15);
    return 0;
}
#+END_SRC

*** 6. Grafos (Graphs)
**** Python
#+BEGIN_SRC python
class Grafo:
    def __init__(self):
        self.vertices = {}

    def agregar_vertice(self, v):
        if v not in self.vertices:
            self.vertices[v] = []

    def agregar_arista(self, v1, v2):
        if v1 in self.vertices and v2 in self.vertices:
            self.vertices[v1].append(v2)
            self.vertices[v2].append(v1)

grafo = Grafo()
grafo.agregar_vertice(1)
grafo.agregar_vertice(2)
grafo.agregar_arista(1, 2)
#+END_SRC

**** C
#+BEGIN_SRC c
#include <stdio.h>
#include <stdlib.h>

#define MAX 100

struct Grafo {
    int matriz[MAX][MAX];
    int numVertices;
};

void inicializarGrafo(struct Grafo* grafo, int vertices) {
    grafo->numVertices = vertices;
    for (int i = 0; i < vertices; i++) {
        for (int j = 0; j < vertices; j++) {
            grafo->matriz[i][j] = 0;
        }
    }
}

void agregarArista(struct Grafo* grafo, int v1, int v2) {
    grafo->matriz[v1][v2] = 1;
    grafo->matriz[v2][v1] = 1;
}

int main() {
    struct Grafo grafo;
    inicializarGrafo(&grafo, 3);
    agregarArista(&grafo, 0, 1);
    agregarArista(&grafo, 1, 2);
    return 0;
}
#+END_SRC


** Problema del Granjero, el Puma, la Cabra y la Lechuga

*** Descripción del Problema
- El granjero necesita cruzar un río llevando consigo un **puma**, una **cabra** y una **lechuga**.
- El bote solo tiene espacio para el granjero y uno de los tres: el **puma**, la **cabra** o la **lechuga**.
- Si el granjero deja al **puma** y a la **cabra** solos sin supervisión, el puma se comerá a la cabra.
- Si el granjero deja a la **cabra** y la **lechuga** solos sin supervisión, la cabra se comerá la lechuga.
- El objetivo es llevar al puma, la cabra y la lechuga al otro lado del río sin que ocurran estas situaciones.

*** Representación del Estado
- Cada estado puede representarse por una tupla `(gran, puma, cabra, lechuga)` donde:
  - `gran`, `puma`, `cabra`, `lechuga` pueden tener el valor `L` (lado izquierdo) o `R` (lado derecho).
  - Ejemplo: `(L, L, L, L)` indica que el granjero, el puma, la cabra y la lechuga están en el lado izquierdo.

