index.html

<li><a id="org0267b8c"></a>C<br />
<div class="outline-text-5" id="text-org0267b8c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span>;
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">izquierdo</span>;
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">derecho</span>;
<span style="color: #c099ff;">}</span>;

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #82aaff;">crearNodo</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">nuevoNodo</span> = <span style="color: #ff995e;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>*<span style="color: #ff995e;">)</span>malloc<span style="color: #ff995e;">(</span><span style="color: #c099ff;">sizeof</span><span style="color: #ff98a4;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span><span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>;
    nuevoNodo-&gt;valor = valor;
    nuevoNodo-&gt;izquierdo = <span style="color: #ff995e;">NULL</span>;
    nuevoNodo-&gt;derecho = <span style="color: #ff995e;">NULL</span>;
    <span style="color: #c099ff;">return</span> nuevoNodo;
<span style="color: #c099ff;">}</span>

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #82aaff;">agregar</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">nodo</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">valor</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>nodo == <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>
        <span style="color: #c099ff;">return</span> crearNodo<span style="color: #ff995e;">(</span>valor<span style="color: #ff995e;">)</span>;

    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>valor &lt; nodo-&gt;valor<span style="color: #ff995e;">)</span>
        nodo-&gt;izquierdo = agregar<span style="color: #ff995e;">(</span>nodo-&gt;izquierdo, valor<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">else</span> <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>valor &gt; nodo-&gt;valor<span style="color: #ff995e;">)</span>
        nodo-&gt;derecho = agregar<span style="color: #ff995e;">(</span>nodo-&gt;derecho, valor<span style="color: #ff995e;">)</span>;

    <span style="color: #c099ff;">return</span> nodo;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Nodo</span>* <span style="color: #ff98a4;">raiz</span> = <span style="color: #ff995e;">NULL</span>;
    raiz = agregar<span style="color: #ff995e;">(</span>raiz, 10<span style="color: #ff995e;">)</span>;
    agregar<span style="color: #ff995e;">(</span>raiz, 5<span style="color: #ff995e;">)</span>;
    agregar<span style="color: #ff995e;">(</span>raiz, 15<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org20e8cd5" class="outline-4">
<h4 id="org20e8cd5">6. Grafos (Graphs)</h4>
<div class="outline-text-4" id="text-org20e8cd5">
</div>
<ul class="org-ul">
<li><a id="org6fab512"></a>Python<br />
<div class="outline-text-5" id="text-org6fab512">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">class</span> <span style="color: #ffc777;">Grafo</span>:
    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">__init__</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span><span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">self</span>.vertices = <span style="color: #c099ff;">{}</span>

    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">agregar_vertice</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, v<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">if</span> v <span style="color: #c099ff;">not</span> <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">vertices</span>:
            <span style="color: #c099ff;">self</span>.vertices<span style="color: #c099ff;">[</span><span style="color: #ff98a4;">v</span><span style="color: #c099ff;">]</span> = <span style="color: #c099ff;">[]</span>

    <span style="color: #c099ff;">def</span> <span style="color: #82aaff;">agregar_arista</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">self</span>, v1, v2<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">if</span> v1 <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">self</span>.vertices <span style="color: #c099ff;">and</span> v2 <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">self</span>.<span style="color: #ff98a4;">vertices</span>:
            <span style="color: #c099ff;">self</span>.vertices<span style="color: #c099ff;">[</span>v1<span style="color: #c099ff;">]</span>.append<span style="color: #c099ff;">(</span>v2<span style="color: #c099ff;">)</span>
            <span style="color: #c099ff;">self</span>.vertices<span style="color: #c099ff;">[</span>v2<span style="color: #c099ff;">]</span>.append<span style="color: #c099ff;">(</span>v1<span style="color: #c099ff;">)</span>

grafo = Grafo<span style="color: #c099ff;">()</span>
grafo.agregar_vertice<span style="color: #c099ff;">(</span>1<span style="color: #c099ff;">)</span>
grafo.agregar_vertice<span style="color: #c099ff;">(</span>2<span style="color: #c099ff;">)</span>
grafo.agregar_arista<span style="color: #c099ff;">(</span>1, 2<span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org7fd46f9"></a>C<br />
<div class="outline-text-5" id="text-org7fd46f9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #86e1fc; font-weight: bold;">#define</span> <span style="color: #ff98a4;">MAX</span> 100

<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Grafo</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">matriz</span><span style="color: #ff995e;">[</span>MAX<span style="color: #ff995e;">][</span>MAX<span style="color: #ff995e;">]</span>;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">numVertices</span>;
<span style="color: #c099ff;">}</span>;

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">inicializarGrafo</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Grafo</span>* <span style="color: #ff98a4;">grafo</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">vertices</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    grafo-&gt;numVertices = vertices;
    <span style="color: #c099ff;">for</span> <span style="color: #ff995e;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">i</span> = 0; i &lt; vertices; i++<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        <span style="color: #c099ff;">for</span> <span style="color: #ff98a4;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">j</span> = 0; j &lt; vertices; j++<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
            grafo-&gt;matriz<span style="color: #b4f9f8;">[</span>i<span style="color: #b4f9f8;">][</span>j<span style="color: #b4f9f8;">]</span> = 0;
        <span style="color: #ff98a4;">}</span>
    <span style="color: #ff995e;">}</span>
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">agregarArista</span><span style="color: #c099ff;">(</span><span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Grafo</span>* <span style="color: #ff98a4;">grafo</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">v1</span>, <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">v2</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    grafo-&gt;matriz<span style="color: #ff995e;">[</span>v1<span style="color: #ff995e;">][</span>v2<span style="color: #ff995e;">]</span> = 1;
    grafo-&gt;matriz<span style="color: #ff995e;">[</span>v2<span style="color: #ff995e;">][</span>v1<span style="color: #ff995e;">]</span> = 1;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">Grafo</span> <span style="color: #ff98a4;">grafo</span>;
    inicializarGrafo<span style="color: #ff995e;">(</span>&amp;grafo, 3<span style="color: #ff995e;">)</span>;
    agregarArista<span style="color: #ff995e;">(</span>&amp;grafo, 0, 1<span style="color: #ff995e;">)</span>;
    agregarArista<span style="color: #ff995e;">(</span>&amp;grafo, 1, 2<span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-org40fbc70" class="outline-3">
<h3 id="org40fbc70">Problema del Granjero, el Puma, la Cabra y la Lechuga</h3>
<div class="outline-text-3" id="text-org40fbc70">
</div>
<div id="outline-container-org123d847" class="outline-4">
<h4 id="org123d847">Descripción del Problema</h4>
<div class="outline-text-4" id="text-org123d847">
<ul class="org-ul">
<li>El granjero necesita cruzar un río llevando consigo un <b><b>puma</b></b>, una <b><b>cabra</b></b> y una <b><b>lechuga</b></b>.</li>
<li>El bote solo tiene espacio para el granjero y uno de los tres: el <b><b>puma</b></b>, la <b><b>cabra</b></b> o la <b><b>lechuga</b></b>.</li>
<li>Si el granjero deja al <b><b>puma</b></b> y a la <b><b>cabra</b></b> solos sin supervisión, el puma se comerá a la cabra.</li>
<li>Si el granjero deja a la <b><b>cabra</b></b> y la <b><b>lechuga</b></b> solos sin supervisión, la cabra se comerá la lechuga.</li>
<li>El objetivo es llevar al puma, la cabra y la lechuga al otro lado del río sin que ocurran estas situaciones.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd72f706" class="outline-4">
<h4 id="orgd72f706">Representación del Estado</h4>
<div class="outline-text-4" id="text-orgd72f706">
<ul class="org-ul">
<li>Cada estado puede representarse por una tupla `(gran, puma, cabra, lechuga)` donde:
<ul class="org-ul">
<li>`gran`, `puma`, `cabra`, `lechuga` pueden tener el valor `L` (lado izquierdo) o `R` (lado derecho).</li>
<li>Ejemplo: `(L, L, L, L)` indica que el granjero, el puma, la cabra y la lechuga están en el lado izquierdo.</li>
</ul></li>
</ul>
</div>
</div>
