Topicos.org
*** Reglas de Transición
- El granjero puede moverse de un lado a otro llevando solo uno de los tres elementos (puma, cabra, lechuga) o viajando solo.
- Las transiciones solo son válidas si no ocurren las situaciones indeseadas:
  - El puma no puede quedarse solo con la cabra sin el granjero.
  - La cabra no puede quedarse sola con la lechuga sin el granjero.

*** Algoritmo de Búsqueda en Profundidad (DFS)

Se utilizará una búsqueda a lo profundo para encontrar la secuencia de movimientos que lleve a todos al lado derecho del río.

#+BEGIN_SRC python
# Resolver el problema usando búsqueda en profundidad (DFS)
def es_estado_valido(estado):
    gran, puma, cabra, lechuga = estado
    # El puma no puede estar solo con la cabra
    if puma == cabra and gran != puma:
        return False
    # La cabra no puede estar sola con la lechuga
    if cabra == lechuga and gran != cabra:
        return False
    return True

def mover(estado, objeto):
    gran, puma, cabra, lechuga = estado
    nuevo_gran = 'R' if gran == 'L' else 'L'
    if objeto == "puma":
        nuevo_puma = 'R' if puma == 'L' else 'L'
        return (nuevo_gran, nuevo_puma, cabra, lechuga)
    elif objeto == "cabra":
        nuevo_cabra = 'R' if cabra == 'L' else 'L'
        return (nuevo_gran, puma, nuevo_cabra, lechuga)
    elif objeto == "lechuga":
        nuevo_lechuga = 'R' if lechuga == 'L' else 'L'
        return (nuevo_gran, puma, cabra, nuevo_lechuga)
    else:  # Si el granjero viaja solo
        return (nuevo_gran, puma, cabra, lechuga)

def dfs(estado, objetivo, visitados):
    if estado == objetivo:
        return [estado]

    visitados.add(estado)

    # Posibles movimientos: granjero viaja solo o con puma, cabra o lechuga
    posibles_movimientos = ["solo", "puma", "cabra", "lechuga"]

    for movimiento in posibles_movimientos:
        nuevo_estado = mover(estado, movimiento)
        if nuevo_estado not in visitados and es_estado_valido(nuevo_estado):
            resultado = dfs(nuevo_estado, objetivo, visitados)
            if resultado:
                return [estado] + resultado

    return None

# Estado inicial: todos en el lado izquierdo
estado_inicial = ('L', 'L', 'L', 'L')

# Estado objetivo: todos en el lado derecho
estado_objetivo = ('R', 'R', 'R', 'R')

# Realizamos la búsqueda
solucion = dfs(estado_inicial, estado_objetivo, set())

if solucion:
    print("Solución encontrada:")
    for paso in solucion:
        print(paso)
else:
    print("No se encontró solución.")
#+END_SRC

*** Árbol de Búsqueda
El árbol de búsqueda para este problema contiene estados donde el granjero, el puma, la cabra y la lechuga pueden estar en diferentes lados del río. Aquí un ejemplo de algunos estados:

- Estado inicial: `(L, L, L, L)`
  - Mover el granjero con la cabra: `(R, L, R, L)`
    - Mover el granjero solo: `(L, L, R, L)`
      - Mover el granjero con el puma: `(R, R, R, L)`
      - ...

Este proceso continúa explorando todos los posibles caminos hasta encontrar el objetivo.

*** Solución del Problema
La búsqueda en profundidad explora las ramas posibles del árbol de búsqueda hasta encontrar una solución válida. Una posible secuencia de movimientos es:

1. Granjero lleva a la cabra: `(R, L, R, L)`
2. Granjero regresa solo: `(L, L, R, L)`
3. Granjero lleva al puma: `(R, R, R, L)`
4. Granjero regresa con la cabra: `(L, R, L, L)`
5. Granjero lleva la lechuga: `(R, R, L, R)`
6. Granjero regresa solo: `(L, R, L, R)`
7. Granjero lleva la cabra: `(R, R, R, R)`

¡Y todos han cruzado el río de manera segura!

** Tutorial de Operaciones Bitwise en OpenCV

Las operaciones *bitwise* en OpenCV son manipulaciones a nivel de bits que se pueden realizar sobre imágenes. Estas operaciones incluyen **AND**, **OR**, **XOR** y **NOT**, y son útiles cuando necesitas combinar, enmascarar, o manipular diferentes partes de una imagen.


