index.html

<div id="outline-container-orge111039" class="outline-4">
<h4 id="orge111039">Reglas de Transición</h4>
<div class="outline-text-4" id="text-orge111039">
<ul class="org-ul">
<li>El granjero puede moverse de un lado a otro llevando solo uno de los tres elementos (puma, cabra, lechuga) o viajando solo.</li>
<li>Las transiciones solo son válidas si no ocurren las situaciones indeseadas:
<ul class="org-ul">
<li>El puma no puede quedarse solo con la cabra sin el granjero.</li>
<li>La cabra no puede quedarse sola con la lechuga sin el granjero.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org690cd67" class="outline-4">
<h4 id="org690cd67">Algoritmo de Búsqueda en Profundidad (DFS)</h4>
<div class="outline-text-4" id="text-org690cd67">
<p>
Se utilizará una búsqueda a lo profundo para encontrar la secuencia de movimientos que lleve a todos al lado derecho del río.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Resolver el problema usando b&#250;squeda en profundidad (DFS)</span>
<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">es_estado_valido</span><span style="color: #c099ff;">(</span>estado<span style="color: #c099ff;">)</span>:
    <span style="color: #ff98a4;">gran</span>, <span style="color: #ff98a4;">puma</span>, <span style="color: #ff98a4;">cabra</span>, <span style="color: #ff98a4;">lechuga</span> = estado
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">El puma no puede estar solo con la cabra</span>
    <span style="color: #c099ff;">if</span> puma == cabra <span style="color: #c099ff;">and</span> gran != puma:
        <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">False</span>
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">La cabra no puede estar sola con la lechuga</span>
    <span style="color: #c099ff;">if</span> cabra == lechuga <span style="color: #c099ff;">and</span> gran != cabra:
        <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">False</span>
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">True</span>

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">mover</span><span style="color: #c099ff;">(</span>estado, objeto<span style="color: #c099ff;">)</span>:
    <span style="color: #ff98a4;">gran</span>, <span style="color: #ff98a4;">puma</span>, <span style="color: #ff98a4;">cabra</span>, <span style="color: #ff98a4;">lechuga</span> = estado
    nuevo_gran = <span style="color: #c3e88d;">'R'</span> <span style="color: #c099ff;">if</span> gran == <span style="color: #c3e88d;">'L'</span> <span style="color: #c099ff;">else</span> <span style="color: #c3e88d;">'L'</span>
    <span style="color: #c099ff;">if</span> objeto == <span style="color: #c3e88d;">"puma"</span>:
        nuevo_puma = <span style="color: #c3e88d;">'R'</span> <span style="color: #c099ff;">if</span> puma == <span style="color: #c3e88d;">'L'</span> <span style="color: #c099ff;">else</span> <span style="color: #c3e88d;">'L'</span>
        <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">(</span>nuevo_gran, nuevo_puma, cabra, lechuga<span style="color: #c099ff;">)</span>
    <span style="color: #c099ff;">elif</span> objeto == <span style="color: #c3e88d;">"cabra"</span>:
        nuevo_cabra = <span style="color: #c3e88d;">'R'</span> <span style="color: #c099ff;">if</span> cabra == <span style="color: #c3e88d;">'L'</span> <span style="color: #c099ff;">else</span> <span style="color: #c3e88d;">'L'</span>
        <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">(</span>nuevo_gran, puma, nuevo_cabra, lechuga<span style="color: #c099ff;">)</span>
    <span style="color: #c099ff;">elif</span> objeto == <span style="color: #c3e88d;">"lechuga"</span>:
        nuevo_lechuga = <span style="color: #c3e88d;">'R'</span> <span style="color: #c099ff;">if</span> lechuga == <span style="color: #c3e88d;">'L'</span> <span style="color: #c099ff;">else</span> <span style="color: #c3e88d;">'L'</span>
        <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">(</span>nuevo_gran, puma, cabra, nuevo_lechuga<span style="color: #c099ff;">)</span>
    <span style="color: #c099ff;">else</span>:  <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Si el granjero viaja solo</span>
        <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">(</span>nuevo_gran, puma, cabra, lechuga<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">def</span> <span style="color: #82aaff;">dfs</span><span style="color: #c099ff;">(</span>estado, objetivo, visitados<span style="color: #c099ff;">)</span>:
    <span style="color: #c099ff;">if</span> estado == objetivo:
        <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">[</span>estado<span style="color: #c099ff;">]</span>

    visitados.add<span style="color: #c099ff;">(</span>estado<span style="color: #c099ff;">)</span>

    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Posibles movimientos: granjero viaja solo o con puma, cabra o lechuga</span>
    posibles_movimientos = <span style="color: #c099ff;">[</span><span style="color: #c3e88d;">"solo"</span>, <span style="color: #c3e88d;">"puma"</span>, <span style="color: #c3e88d;">"cabra"</span>, <span style="color: #c3e88d;">"lechuga"</span><span style="color: #c099ff;">]</span>

    <span style="color: #c099ff;">for</span> movimiento <span style="color: #c099ff;">in</span> posibles_movimientos:
        nuevo_estado = mover<span style="color: #c099ff;">(</span>estado, movimiento<span style="color: #c099ff;">)</span>
        <span style="color: #c099ff;">if</span> nuevo_estado <span style="color: #c099ff;">not</span> <span style="color: #c099ff;">in</span> visitados <span style="color: #c099ff;">and</span> es_estado_valido<span style="color: #c099ff;">(</span>nuevo_estado<span style="color: #c099ff;">)</span>:
            resultado = dfs<span style="color: #c099ff;">(</span>nuevo_estado, objetivo, visitados<span style="color: #c099ff;">)</span>
            <span style="color: #c099ff;">if</span> resultado:
                <span style="color: #c099ff;">return</span> <span style="color: #c099ff;">[</span>estado<span style="color: #c099ff;">]</span> + resultado

    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">None</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Estado inicial: todos en el lado izquierdo</span>
estado_inicial = <span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'L'</span>, <span style="color: #c3e88d;">'L'</span>, <span style="color: #c3e88d;">'L'</span>, <span style="color: #c3e88d;">'L'</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Estado objetivo: todos en el lado derecho</span>
estado_objetivo = <span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'R'</span>, <span style="color: #c3e88d;">'R'</span>, <span style="color: #c3e88d;">'R'</span>, <span style="color: #c3e88d;">'R'</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Realizamos la b&#250;squeda</span>
solucion = dfs<span style="color: #c099ff;">(</span>estado_inicial, estado_objetivo, <span style="color: #c099ff;">set</span><span style="color: #ff995e;">()</span><span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">if</span> solucion:
    <span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Soluci&#243;n encontrada:"</span><span style="color: #c099ff;">)</span>
    <span style="color: #c099ff;">for</span> paso <span style="color: #c099ff;">in</span> solucion:
        <span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>paso<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">else</span>:
    <span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"No se encontr&#243; soluci&#243;n."</span><span style="color: #c099ff;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e6c5f3" class="outline-4">
<h4 id="org8e6c5f3">Árbol de Búsqueda</h4>
<div class="outline-text-4" id="text-org8e6c5f3">
<p>
El árbol de búsqueda para este problema contiene estados donde el granjero, el puma, la cabra y la lechuga pueden estar en diferentes lados del río. Aquí un ejemplo de algunos estados:
</p>

<ul class="org-ul">
<li>Estado inicial: `(L, L, L, L)`
<ul class="org-ul">
<li>Mover el granjero con la cabra: `(R, L, R, L)`
<ul class="org-ul">
<li>Mover el granjero solo: `(L, L, R, L)`
<ul class="org-ul">
<li>Mover el granjero con el puma: `(R, R, R, L)`</li>
<li>&#x2026;</li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<p>
Este proceso continúa explorando todos los posibles caminos hasta encontrar el objetivo.
</p>
</div>
</div>

<div id="outline-container-org77821c0" class="outline-4">
<h4 id="org77821c0">Solución del Problema</h4>
<div class="outline-text-4" id="text-org77821c0">
<p>
La búsqueda en profundidad explora las ramas posibles del árbol de búsqueda hasta encontrar una solución válida. Una posible secuencia de movimientos es:
</p>

<ol class="org-ol">
<li>Granjero lleva a la cabra: `(R, L, R, L)`</li>
<li>Granjero regresa solo: `(L, L, R, L)`</li>
<li>Granjero lleva al puma: `(R, R, R, L)`</li>
<li>Granjero regresa con la cabra: `(L, R, L, L)`</li>
<li>Granjero lleva la lechuga: `(R, R, L, R)`</li>
<li>Granjero regresa solo: `(L, R, L, R)`</li>
<li>Granjero lleva la cabra: `(R, R, R, R)`</li>
</ol>

<p>
¡Y todos han cruzado el río de manera segura!
</p>
</div>
</div>
</div>

<div id="outline-container-orgc8c1585" class="outline-3">
<h3 id="orgc8c1585">Tutorial de Operaciones Bitwise en OpenCV</h3>
<div class="outline-text-3" id="text-orgc8c1585">
<p>
Las operaciones <b>bitwise</b> en OpenCV son manipulaciones a nivel de bits que se pueden realizar sobre imágenes. Estas operaciones incluyen <b><b>AND</b></b>, <b><b>OR</b></b>, <b><b>XOR</b></b> y <b><b>NOT</b></b>, y son útiles cuando necesitas combinar, enmascarar, o manipular diferentes partes de una imagen.
</p>
</div>
