Topicos.org
*** 1. Operación Bitwise AND
La operación **AND** toma dos imágenes o una imagen y una máscara, y realiza la operación AND bit a bit. El resultado será una imagen donde los bits que son 1 en ambas entradas se mantendrán, mientras que los demás bits serán 0.

#+BEGIN_SRC python
import cv2
import numpy as np

# Crear dos imágenes binarias
img1 = np.zeros((300, 300), dtype="uint8")
img2 = np.zeros((300, 300), dtype="uint8")

# Dibujar un rectángulo blanco en la primera imagen
cv2.rectangle(img1, (50, 50), (250, 250), 255, -1)

# Dibujar un círculo blanco en la segunda imagen
cv2.circle(img2, (150, 150), 100, 255, -1)

# Aplicar la operación bitwise AND
resultado_and = cv2.bitwise_and(img1, img2)

# Mostrar las imágenes
cv2.imshow("Imagen 1", img1)
cv2.imshow("Imagen 2", img2)
cv2.imshow("Resultado AND", resultado_and)
cv2.waitKey(0)
cv2.destroyAllWindows()
#+END_SRC

*** 2. Operación Bitwise OR
La operación **OR** toma dos imágenes y realiza la operación OR bit a bit. Los bits que son 1 en cualquiera de las dos entradas permanecerán en el resultado.

#+BEGIN_SRC python
# Aplicar la operación bitwise OR
resultado_or = cv2.bitwise_or(img1, img2)

# Mostrar el resultado
cv2.imshow("Resultado OR", resultado_or)
cv2.waitKey(0)
cv2.destroyAllWindows()
#+END_SRC

*** 3. Operación Bitwise XOR
La operación **XOR** compara los bits de dos imágenes y deja un 1 en la posición del resultado solo si los bits de las entradas son diferentes.

#+BEGIN_SRC python
# Aplicar la operación bitwise XOR
resultado_xor = cv2.bitwise_xor(img1, img2)

# Mostrar el resultado
cv2.imshow("Resultado XOR", resultado_xor)
cv2.waitKey(0)
cv2.destroyAllWindows()
#+END_SRC

*** 4. Operación Bitwise NOT
La operación **NOT** invierte todos los bits de la imagen (los 1s se convierten en 0s y viceversa).

#+BEGIN_SRC python
# Aplicar la operación bitwise NOT sobre la primera imagen
resultado_not = cv2.bitwise_not(img1)

# Mostrar el resultado
cv2.imshow("Resultado NOT", resultado_not)
cv2.waitKey(0)
cv2.destroyAllWindows()
#+END_SRC

*** 5. Aplicaciones Prácticas
Las operaciones bitwise son útiles en muchas aplicaciones, como:

- **Enmascaramiento**: Puedes usar una máscara para seleccionar ciertas partes de una imagen y realizar operaciones solo en esas áreas.
- **Fusión de imágenes**: Combinar dos imágenes de manera controlada.
- **Operaciones en regiones de interés (ROI)**: Manipular partes específicas de una imagen sin afectar el resto.

Por ejemplo, puedes crear una máscara que seleccione solo una región de interés en una imagen y aplicar una operación bitwise AND para enfocarte en esa área.

#+BEGIN_SRC python
# Leer una imagen en color
img = cv2.imread("ruta/a/tu/imagen.jpg")

# Crear una máscara (un círculo en el centro de la imagen)
mascara = np.zeros(img.shape[:2], dtype="uint8")
cv2.circle(mascara, (img.shape[1]//2, img.shape[0]//2), 100, 255, -1)

# Aplicar bitwise AND para extraer solo el área dentro del círculo
resultado_mascara = cv2.bitwise_and(img, img, mask=mascara)

# Mostrar la imagen original, la máscara y el resultado
cv2.imshow("Imagen Original", img)
cv2.imshow("Máscara", mascara)
cv2.imshow("Resultado con Máscara", resultado_mascara)
cv2.waitKey(0)
cv2.destroyAllWindows()
#+END_SRC

*** Definición: Operación Bit a Bit

Una **operación bit a bit** (en inglés, *bitwise operation*) es una operación que se realiza directamente sobre los bits de los operandos. Las operaciones se ejecutan sobre los bits correspondientes de los números en formato binario.

**** Principales operaciones bit a bit

***** 1. AND bit a bit (~&~)
Devuelve `1` si ambos bits en la misma posición son `1`, de lo contrario devuelve `0`.

#+BEGIN_EXAMPLE
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 1000 (8 en decimal)
#+END_EXAMPLE

***** 2. OR bit a bit (~|~)
Devuelve `1` si al menos uno de los bits en la misma posición es `1`, de lo contrario devuelve `0`.

#+BEGIN_EXAMPLE
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 1110 (14 en decimal)
#+END_EXAMPLE

***** 3. XOR bit a bit (~^~)
Devuelve `1` si los bits en la misma posición son diferentes, y `0` si son iguales.

#+BEGIN_EXAMPLE
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 0110 (6 en decimal)
#+END_EXAMPLE

***** 4. NOT bit a bit (~~)
Invierte los bits de un número: convierte los `0` en `1` y los `1` en `0`. En sistemas de complemento a dos, esto también implica cambiar el signo de un número entero.

#+BEGIN_EXAMPLE
A = 1010 (10 en decimal)
Resultado: 0101 (-11 en decimal, si estamos usando complemento a dos)
#+END_EXAMPLE

