index.html


<div id="outline-container-org0eac491" class="outline-4">
<h4 id="org0eac491">1. Operación Bitwise AND</h4>
<div class="outline-text-4" id="text-org0eac491">
<p>
La operación <b><b>AND</b></b> toma dos imágenes o una imagen y una máscara, y realiza la operación AND bit a bit. El resultado será una imagen donde los bits que son 1 en ambas entradas se mantendrán, mientras que los demás bits serán 0.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> cv2
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Crear dos im&#225;genes binarias</span>
<span style="color: #ff98a4;">img1</span> = np.zeros<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>300, 300<span style="color: #ff995e;">)</span>, dtype=<span style="color: #c3e88d;">"uint8"</span><span style="color: #c099ff;">)</span>
img2 = np.zeros<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>300, 300<span style="color: #ff995e;">)</span>, dtype=<span style="color: #c3e88d;">"uint8"</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Dibujar un rect&#225;ngulo blanco en la primera imagen</span>
cv2.rectangle<span style="color: #c099ff;">(</span>img1, <span style="color: #ff995e;">(</span>50, 50<span style="color: #ff995e;">)</span>, <span style="color: #ff995e;">(</span>250, 250<span style="color: #ff995e;">)</span>, 255, -1<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Dibujar un c&#237;rculo blanco en la segunda imagen</span>
cv2.circle<span style="color: #c099ff;">(</span>img2, <span style="color: #ff995e;">(</span>150, 150<span style="color: #ff995e;">)</span>, 100, 255, -1<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Aplicar la operaci&#243;n bitwise AND</span>
resultado_and = cv2.bitwise_and<span style="color: #c099ff;">(</span>img1, img2<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar las im&#225;genes</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Imagen 1"</span>, img1<span style="color: #c099ff;">)</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Imagen 2"</span>, img2<span style="color: #c099ff;">)</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Resultado AND"</span>, resultado_and<span style="color: #c099ff;">)</span>
cv2.waitKey<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfa93649" class="outline-4">
<h4 id="orgfa93649">2. Operación Bitwise OR</h4>
<div class="outline-text-4" id="text-orgfa93649">
<p>
La operación <b><b>OR</b></b> toma dos imágenes y realiza la operación OR bit a bit. Los bits que son 1 en cualquiera de las dos entradas permanecerán en el resultado.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Aplicar la operaci&#243;n bitwise OR</span>
<span style="color: #ff98a4;">resultado_or</span> = cv2.bitwise_or<span style="color: #c099ff;">(</span>img1, img2<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar el resultado</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Resultado OR"</span>, resultado_or<span style="color: #c099ff;">)</span>
cv2.waitKey<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc616670" class="outline-4">
<h4 id="orgc616670">3. Operación Bitwise XOR</h4>
<div class="outline-text-4" id="text-orgc616670">
<p>
La operación <b><b>XOR</b></b> compara los bits de dos imágenes y deja un 1 en la posición del resultado solo si los bits de las entradas son diferentes.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Aplicar la operaci&#243;n bitwise XOR</span>
<span style="color: #ff98a4;">resultado_xor</span> = cv2.bitwise_xor<span style="color: #c099ff;">(</span>img1, img2<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar el resultado</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Resultado XOR"</span>, resultado_xor<span style="color: #c099ff;">)</span>
cv2.waitKey<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org03183ff" class="outline-4">
<h4 id="org03183ff">4. Operación Bitwise NOT</h4>
<div class="outline-text-4" id="text-org03183ff">
<p>
La operación <b><b>NOT</b></b> invierte todos los bits de la imagen (los 1s se convierten en 0s y viceversa).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Aplicar la operaci&#243;n bitwise NOT sobre la primera imagen</span>
<span style="color: #ff98a4;">resultado_not</span> = cv2.bitwise_not<span style="color: #c099ff;">(</span>img1<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar el resultado</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Resultado NOT"</span>, resultado_not<span style="color: #c099ff;">)</span>
cv2.waitKey<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf76e5d6" class="outline-4">
<h4 id="orgf76e5d6">5. Aplicaciones Prácticas</h4>
<div class="outline-text-4" id="text-orgf76e5d6">
<p>
Las operaciones bitwise son útiles en muchas aplicaciones, como:
</p>

<ul class="org-ul">
<li><b><b>Enmascaramiento</b></b>: Puedes usar una máscara para seleccionar ciertas partes de una imagen y realizar operaciones solo en esas áreas.</li>
<li><b><b>Fusión de imágenes</b></b>: Combinar dos imágenes de manera controlada.</li>
<li><b><b>Operaciones en regiones de interés (ROI)</b></b>: Manipular partes específicas de una imagen sin afectar el resto.</li>
</ul>

<p>
Por ejemplo, puedes crear una máscara que seleccione solo una región de interés en una imagen y aplicar una operación bitwise AND para enfocarte en esa área.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Leer una imagen en color</span>
<span style="color: #ff98a4;">img</span> = cv2.imread<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"ruta/a/tu/imagen.jpg"</span><span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Crear una m&#225;scara (un c&#237;rculo en el centro de la imagen)</span>
<span style="color: #ff98a4;">mascara</span> = np.zeros<span style="color: #c099ff;">(</span>img.shape<span style="color: #ff995e;">[</span>:2<span style="color: #ff995e;">]</span>, dtype=<span style="color: #c3e88d;">"uint8"</span><span style="color: #c099ff;">)</span>
cv2.circle<span style="color: #c099ff;">(</span>mascara, <span style="color: #ff995e;">(</span>img.shape<span style="color: #ff98a4;">[</span>1<span style="color: #ff98a4;">]</span>//2, img.shape<span style="color: #ff98a4;">[</span>0<span style="color: #ff98a4;">]</span>//2<span style="color: #ff995e;">)</span>, 100, 255, -1<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Aplicar bitwise AND para extraer solo el &#225;rea dentro del c&#237;rculo</span>
resultado_mascara = cv2.bitwise_and<span style="color: #c099ff;">(</span>img, img, mask=mascara<span style="color: #c099ff;">)</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar la imagen original, la m&#225;scara y el resultado</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Imagen Original"</span>, img<span style="color: #c099ff;">)</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"M&#225;scara"</span>, mascara<span style="color: #c099ff;">)</span>
cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"Resultado con M&#225;scara"</span>, resultado_mascara<span style="color: #c099ff;">)</span>
cv2.waitKey<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org568a5f8" class="outline-4">
<h4 id="org568a5f8">Definición: Operación Bit a Bit</h4>
<div class="outline-text-4" id="text-org568a5f8">
<p>
Una <b><b>operación bit a bit</b></b> (en inglés, <b>bitwise operation</b>) es una operación que se realiza directamente sobre los bits de los operandos. Las operaciones se ejecutan sobre los bits correspondientes de los números en formato binario.
</p>
</div>

<ul class="org-ul">
<li><a id="orgc0bfa73"></a>Principales operaciones bit a bit<br />
<ul class="org-ul">
<li><a id="org0f66640"></a>1. AND bit a bit (<code>&amp;</code>)<br />
<div class="outline-text-6" id="text-org0f66640">
<p>
Devuelve `1` si ambos bits en la misma posición son `1`, de lo contrario devuelve `0`.
</p>

<pre class="example" id="org518eb85">
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 1000 (8 en decimal)
</pre>
</div>
</li>

<li><a id="org6ab3487"></a>2. OR bit a bit (<code>|</code>)<br />
<div class="outline-text-6" id="text-org6ab3487">
<p>
Devuelve `1` si al menos uno de los bits en la misma posición es `1`, de lo contrario devuelve `0`.
</p>

<pre class="example" id="org4decec3">
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 1110 (14 en decimal)
</pre>
</div>
</li>

<li><a id="org576fde1"></a>3. XOR bit a bit (<code>^</code>)<br />
<div class="outline-text-6" id="text-org576fde1">
<p>
Devuelve `1` si los bits en la misma posición son diferentes, y `0` si son iguales.
</p>

<pre class="example" id="orgcf546c5">
A = 1010 (10 en decimal)
B = 1100 (12 en decimal)
Resultado: 0110 (6 en decimal)
</pre>
</div>
</li>

<li><a id="org174abbc"></a>4. NOT bit a bit (~~)<br />
<div class="outline-text-6" id="text-org174abbc">
<p>
Invierte los bits de un número: convierte los `0` en `1` y los `1` en `0`. En sistemas de complemento a dos, esto también implica cambiar el signo de un número entero.
</p>

<pre class="example" id="org7953dcb">
A = 1010 (10 en decimal)
Resultado: 0101 (-11 en decimal, si estamos usando complemento a dos)
</pre>
</div>
</li>
