Topicos.org
***** 5. Desplazamiento a la izquierda (~<<~)
Desplaza todos los bits del número hacia la izquierda por un número específico de posiciones. Los bits desplazados fuera del límite se descartan y se rellenan con ceros en el extremo derecho.

#+BEGIN_EXAMPLE
A = 0001 (1 en decimal)
A << 2 = 0100 (4 en decimal)
#+END_EXAMPLE

***** 6. Desplazamiento a la derecha (~>>~)
Desplaza todos los bits del número hacia la derecha por un número específico de posiciones. Los bits desplazados fuera del límite se descartan y el bit más significativo depende del signo del número.

#+BEGIN_EXAMPLE
A = 1000 (8 en decimal)
A >> 2 = 0010 (2 en decimal)
#+END_EXAMPLE

***** Aplicaciones de las operaciones bit a bit

- **Máscaras de bits**: Las operaciones bit a bit se usan para aplicar máscaras que seleccionan o modifican partes específicas de un número o secuencia binaria.
- **Manipulación de imágenes**: En procesamiento de imágenes, las operaciones bit a bit son útiles para combinar y modificar píxeles en OpenCV.
- **Optimización de algoritmos**: Las operaciones bit a bit permiten optimizar cálculos en sistemas de bajo nivel o con restricciones de recursos.








#+BEGIN_SRC python :results output
import numpy as np 
import cv2 as cv

#img = np.ones((500,500), dtype=np.uint8)*255
img = cv.imread('tr.png', 1)
x,y=img.shape[:2]
img2 = np.zeros((x,y), dtype=np.uint8)

print(img.shape, x , y)
r,g,b =cv.split(img)

result = cv.merge([g,b,r])
#rr=cv.merge([r,img2,img2])
#gg=cv.merge([img2,g,img2])
#bb=cv.merge([img2,img2,b])
cv.imshow('img', result)
#cv.imshow('r', r)
#cv.imshow('g', g)
#cv.imshow('b', b)
#cv.imshow('rr', rr)
#cv.imshow('gg', gg)
#cv.imshow('bb', bb)
cv.waitKey()
cv.destroyAllWindows()

#+END_SRC

#+RESULTS:
: (632, 635, 3) 632 635

#+BEGIN_SRC python
import numpy as np 
import cv2 as cv

img = cv.imread('tr.png', 0)
x,y=img.shape
img2 = np.zeros((x*2,y*2), dtype=np.uint8)

for i in range(x):
    for j in range(y):
        img2[int(i*0.5),int(j*0.5)] = img[i,j]
    
cv.imshow('img', img2)
cv.waitKey()
cv.destroyAllWindows()
#+END_SRC

#+BEGIN_SRC python
import numpy as np
import cv2 as cv

img = cv.imread('tr.png', 0)
x,y=img.shape
img2 = np.zeros((x,y), dtype=np.uint8)

for i in range(x):
    for j in range(y):
        if img[i,j]>150:
            img2[i,j] = 255
        else:
            img2[i,j] = 0
            
cv.imshow('img', img2)
cv.waitKey()
cv.destroyAllWindows()
#+END_SRC

#+BEGIN_SRC python
import cv2 as cv
cap = cv.VideoCapture(0)
while(True):
         ret, img = cap.read()
	 if ret == True:
                  #img = cv.cvtColor(img, cv.COLOR_BGR2GRAY)
                  img3 = cv.cvtColor(img, cv.COLOR_BGR2HSV)
		  cv.imshow('video', img3)
		  k =cv.waitKey(1) & 0xFF
		  if k == 27 :
			   break
	 else:
		  break
cap.release()
cv.destroyAllWindows()

#+END_SRC

#+RESULTS:
: None


,#+RESULTS:
: None







,#+BEGIN_SRC python
import cv2 as cv
import numpy as np

img = np.ones((500, 500), dtype=np.uint8)*156
cv.imshow('img', img)
cv.waitKey()
cv.destroyAllWindows()
#+END_SRC

#+RESULTS:






#+BEGIN_SRC c :result output

#include <stdio.h>

typedef struct nodo{
int dato;
char info;
struct nodo *sig;
struct nodo *ant;
}nodo;

int main(){


}

#+END_SRC

