index.html

<li><a id="orgd4033df"></a>5. Desplazamiento a la izquierda (<code>&lt;&lt;</code>)<br />
<div class="outline-text-6" id="text-orgd4033df">
<p>
Desplaza todos los bits del número hacia la izquierda por un número específico de posiciones. Los bits desplazados fuera del límite se descartan y se rellenan con ceros en el extremo derecho.
</p>

<pre class="example" id="org509f3fb">
A = 0001 (1 en decimal)
A &lt;&lt; 2 = 0100 (4 en decimal)
</pre>
</div>
</li>

<li><a id="orge32761f"></a>6. Desplazamiento a la derecha (<code>&gt;&gt;</code>)<br />
<div class="outline-text-6" id="text-orge32761f">
<p>
Desplaza todos los bits del número hacia la derecha por un número específico de posiciones. Los bits desplazados fuera del límite se descartan y el bit más significativo depende del signo del número.
</p>

<pre class="example" id="org54e50e6">
A = 1000 (8 en decimal)
A &gt;&gt; 2 = 0010 (2 en decimal)
</pre>
</div>
</li>

<li><a id="orgf6c5b66"></a>Aplicaciones de las operaciones bit a bit<br />
<div class="outline-text-6" id="text-orgf6c5b66">
<ul class="org-ul">
<li><b><b>Máscaras de bits</b></b>: Las operaciones bit a bit se usan para aplicar máscaras que seleccionan o modifican partes específicas de un número o secuencia binaria.</li>
<li><b><b>Manipulación de imágenes</b></b>: En procesamiento de imágenes, las operaciones bit a bit son útiles para combinar y modificar píxeles en OpenCV.</li>
<li><b><b>Optimización de algoritmos</b></b>: Las operaciones bit a bit permiten optimizar cálculos en sistemas de bajo nivel o con restricciones de recursos.</li>
</ul>








<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np 
<span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv

<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">img = np.ones((500,500), dtype=np.uint8)*255</span>
<span style="color: #ff98a4;">img</span> = cv.imread<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'tr.png'</span>, 1<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">x</span>,<span style="color: #ff98a4;">y</span>=img.shape<span style="color: #c099ff;">[</span>:2<span style="color: #c099ff;">]</span>
<span style="color: #ff98a4;">img2</span> = np.zeros<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>x,y<span style="color: #ff995e;">)</span>, dtype=np.uint8<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">print</span><span style="color: #c099ff;">(</span>img.shape, x , y<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">r</span>,<span style="color: #ff98a4;">g</span>,<span style="color: #ff98a4;">b</span> =cv.split<span style="color: #c099ff;">(</span>img<span style="color: #c099ff;">)</span>

result = cv.merge<span style="color: #c099ff;">(</span><span style="color: #ff995e;">[</span>g,b,r<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">rr=cv.merge([r,img2,img2])</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">gg=cv.merge([img2,g,img2])</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">bb=cv.merge([img2,img2,b])</span>
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img'</span>, result<span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('r', r)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('g', g)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('b', b)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('rr', rr)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('gg', gg)</span>
<span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">cv.imshow('bb', bb)</span>
cv.waitKey<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np 
<span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv

<span style="color: #ff98a4;">img</span> = cv.imread<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'tr.png'</span>, 0<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">x</span>,<span style="color: #ff98a4;">y</span>=img.shape
<span style="color: #ff98a4;">img2</span> = np.zeros<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>x*2,y*2<span style="color: #ff995e;">)</span>, dtype=np.uint8<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">for</span> i <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span><span style="color: #c099ff;">(</span>x<span style="color: #c099ff;">)</span>:
    <span style="color: #c099ff;">for</span> j <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span><span style="color: #c099ff;">(</span>y<span style="color: #c099ff;">)</span>:
        img2<span style="color: #c099ff;">[</span><span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>i*0.5<span style="color: #ff995e;">)</span>,<span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>j*0.5<span style="color: #ff995e;">)</span><span style="color: #c099ff;">]</span> = img<span style="color: #c099ff;">[</span>i,j<span style="color: #c099ff;">]</span>
    
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img'</span>, img2<span style="color: #c099ff;">)</span>
cv.waitKey<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np
<span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv

<span style="color: #ff98a4;">img</span> = cv.imread<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'tr.png'</span>, 0<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">x</span>,<span style="color: #ff98a4;">y</span>=img.shape
<span style="color: #ff98a4;">img2</span> = np.zeros<span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>x,y<span style="color: #ff995e;">)</span>, dtype=np.uint8<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">for</span> i <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span><span style="color: #c099ff;">(</span>x<span style="color: #c099ff;">)</span>:
    <span style="color: #c099ff;">for</span> j <span style="color: #c099ff;">in</span> <span style="color: #c099ff;">range</span><span style="color: #c099ff;">(</span>y<span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">if</span> img<span style="color: #c099ff;">[</span>i,j<span style="color: #c099ff;">]</span>&gt;150:
            img2<span style="color: #c099ff;">[</span><span style="color: #ff98a4;">i</span>,<span style="color: #ff98a4;">j</span><span style="color: #c099ff;">]</span> = 255
        <span style="color: #c099ff;">else</span>:
            img2<span style="color: #c099ff;">[</span><span style="color: #ff98a4;">i</span>,<span style="color: #ff98a4;">j</span><span style="color: #c099ff;">]</span> = 0
            
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img'</span>, img2<span style="color: #c099ff;">)</span>
cv.waitKey<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv
<span style="color: #ff98a4;">cap</span> = cv.VideoCapture<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
<span style="color: #c099ff;">while</span><span style="color: #c099ff;">(</span><span style="color: #ff995e;">True</span><span style="color: #c099ff;">)</span>:
         <span style="color: #ff98a4;">ret</span>, <span style="color: #ff98a4;">img</span> = cap.read<span style="color: #c099ff;">()</span>
         <span style="color: #c099ff;">if</span> ret == <span style="color: #ff995e;">True</span>:
                  <span style="color: #7a88cf;">#</span><span style="color: #7a88cf;">img = cv.cvtColor(img, cv.COLOR_BGR2GRAY)</span>
                  img3 = cv.cvtColor<span style="color: #c099ff;">(</span>img, cv.COLOR_BGR2HSV<span style="color: #c099ff;">)</span>
                  cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'video'</span>, img3<span style="color: #c099ff;">)</span>
                  k =cv.waitKey<span style="color: #c099ff;">(</span>1<span style="color: #c099ff;">)</span> &amp; 0xFF
                  <span style="color: #c099ff;">if</span> k == 27 :
                           <span style="color: #c099ff;">break</span>
         <span style="color: #c099ff;">else</span>:
                  <span style="color: #c099ff;">break</span>
cap.release<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>

</pre>
</div>


<p>
,#+RESULTS:
</p>
<pre class="example">
None
</pre>








<p>
,#+BEGIN<sub>SRC</sub> python
import cv2 as cv
import numpy as np
</p>

<p>
img = np.ones((500, 500), dtype=np.uint8)*156
cv.imshow('img', img)
cv.waitKey()
cv.destroyAllWindows()
#+END<sub>SRC</sub>
</p>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #c099ff;">typedef</span> <span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">nodo</span><span style="color: #c099ff;">{</span>
<span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">dato</span>;
<span style="color: #ffc777;">char</span> <span style="color: #ff98a4;">info</span>;
<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">nodo</span> *<span style="color: #ff98a4;">sig</span>;
<span style="color: #c099ff;">struct</span> <span style="color: #ffc777;">nodo</span> *<span style="color: #ff98a4;">ant</span>;
<span style="color: #c099ff;">}</span><span style="color: #ffc777;">nodo</span>;

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">(){</span>


<span style="color: #c099ff;">}</span>

</pre>
</div>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
