index.html

<div id="outline-container-org4aadcbe" class="outline-3">
<h3 id="org4aadcbe">Segmentación de color mediante el modelo de color HSV</h3>
<div class="outline-text-3" id="text-org4aadcbe">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv

<span style="color: #ff98a4;">img</span> = cv.imread<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'man1.jpg'</span>, 1<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">hsv</span> = cv.cvtColor<span style="color: #c099ff;">(</span>img, cv.COLOR_BGR2HSV<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">uba</span>=<span style="color: #c099ff;">(</span>10, 255, 255<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">ubb</span>=<span style="color: #c099ff;">(</span>0, 40 ,40<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">uba2</span>=<span style="color: #c099ff;">(</span>180, 255, 255<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">ubb2</span>=<span style="color: #c099ff;">(</span>170, 40,40<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">mask1</span> = cv.inRange<span style="color: #c099ff;">(</span>hsv, ubb, uba<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">mask2</span> = cv.inRange<span style="color: #c099ff;">(</span>hsv, ubb2, uba2<span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">mask</span> = mask1+mask2
<span style="color: #ff98a4;">res</span> = cv.bitwise_and<span style="color: #c099ff;">(</span>img, img, mask=mask<span style="color: #c099ff;">)</span>
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'mask1'</span>, mask1<span style="color: #c099ff;">)</span>
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'mask2'</span>, mask2<span style="color: #c099ff;">)</span>

cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'res'</span>, res<span style="color: #c099ff;">)</span>
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'hsv'</span>, hsv <span style="color: #c099ff;">)</span>
cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img'</span>, img<span style="color: #c099ff;">)</span>

cv.waitKey<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> cv2 <span style="color: #c099ff;">as</span> cv
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np
<span style="color: #ff98a4;">cap</span> = cv.VideoCapture<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>

<span style="color: #c099ff;">while</span><span style="color: #c099ff;">(</span><span style="color: #ff995e;">True</span><span style="color: #c099ff;">)</span>:
    <span style="color: #ff98a4;">ret</span>, <span style="color: #ff98a4;">img</span> = cap.read<span style="color: #c099ff;">()</span>
    <span style="color: #c099ff;">if</span> <span style="color: #ff98a4;">ret</span>:
        cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'video'</span>, img<span style="color: #c099ff;">)</span>
        hsv = cv.cvtColor<span style="color: #c099ff;">(</span>img, cv.COLOR_BGR2HSV<span style="color: #c099ff;">)</span>
        <span style="color: #ff98a4;">uba</span>=<span style="color: #c099ff;">(</span>90, 255, 255<span style="color: #c099ff;">)</span>
        <span style="color: #ff98a4;">ubb</span>=<span style="color: #c099ff;">(</span>40, 40 ,40<span style="color: #c099ff;">)</span>
        <span style="color: #ff98a4;">mask</span> = cv.inRange<span style="color: #c099ff;">(</span>hsv, ubb, uba<span style="color: #c099ff;">)</span>
        <span style="color: #ff98a4;">res</span> = cv.bitwise_and<span style="color: #c099ff;">(</span>img, img, mask=mask<span style="color: #c099ff;">)</span>
        cv.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'res'</span>, res<span style="color: #c099ff;">)</span>
        
        k =cv.waitKey<span style="color: #c099ff;">(</span>1<span style="color: #c099ff;">)</span> &amp; 0xFF
        <span style="color: #c099ff;">if</span> k == 27 :
            <span style="color: #c099ff;">break</span>
    <span style="color: #c099ff;">else</span>:
        <span style="color: #c099ff;">break</span>
    
cap.release<span style="color: #c099ff;">()</span>
cv.destroyAllWindows<span style="color: #c099ff;">()</span>
</pre>
</div>
</div>
</div>
