index.html









<div id="outline-container-org97b20d1" class="outline-3">
<h3 id="org97b20d1">Seguimiento Por color</h3>
<div class="outline-text-3" id="text-org97b20d1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #c099ff;">import</span> cv2
<span style="color: #c099ff;">import</span> numpy <span style="color: #c099ff;">as</span> np

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Iniciar la captura de video desde la c&#225;mara</span>
<span style="color: #ff98a4;">cap</span> = cv2.VideoCapture<span style="color: #c099ff;">(</span>0<span style="color: #c099ff;">)</span>
<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Definir el rango de color que quieres rastrear en el espacio de color HSV (en este caso, azul)</span>
<span style="color: #ff98a4;">lower_blue</span> = np.array<span style="color: #c099ff;">(</span><span style="color: #ff995e;">[</span>100, 150, 0<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">upper_blue</span> = np.array<span style="color: #c099ff;">(</span><span style="color: #ff995e;">[</span>140, 255, 255<span style="color: #ff995e;">]</span><span style="color: #c099ff;">)</span>
<span style="color: #ff98a4;">img2</span>=<span style="color: #ff995e;">None</span>
<span style="color: #ff98a4;">i</span>=0
<span style="color: #c099ff;">while</span> <span style="color: #ff995e;">True</span>:
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Capturar frame por frame</span>
    <span style="color: #ff98a4;">ret</span>, <span style="color: #ff98a4;">frame</span> = cap.read<span style="color: #c099ff;">()</span>
    <span style="color: #c099ff;">if</span> <span style="color: #c099ff;">not</span> <span style="color: #ff98a4;">ret</span>:
        <span style="color: #c099ff;">break</span>
    
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Convertir el frame de BGR a HSV</span>
    hsv = cv2.cvtColor<span style="color: #c099ff;">(</span>frame, cv2.COLOR_BGR2HSV<span style="color: #c099ff;">)</span>
    
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Crear una m&#225;scara que detecte solo el color azul</span>
    <span style="color: #ff98a4;">mask</span> = cv2.inRange<span style="color: #c099ff;">(</span>hsv, lower_blue, upper_blue<span style="color: #c099ff;">)</span>
    
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Filtrar la m&#225;scara con operaciones morfol&#243;gicas</span>
    <span style="color: #ff98a4;">mask</span> = cv2.erode<span style="color: #c099ff;">(</span>mask, <span style="color: #ff995e;">None</span>, iterations=2<span style="color: #c099ff;">)</span>
    mask = cv2.dilate<span style="color: #c099ff;">(</span>mask, <span style="color: #ff995e;">None</span>, iterations=2<span style="color: #c099ff;">)</span>
    
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Encontrar contornos en la m&#225;scara</span>
    contours, _ = cv2.findContours<span style="color: #c099ff;">(</span>mask, cv2.RETR_EXTERNAL, cv2.CHAIN_APPROX_SIMPLE<span style="color: #c099ff;">)</span>
    
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Si se encuentra al menos un contorno, seguir el objeto</span>
    <span style="color: #c099ff;">if</span> contours:
        <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Tomar el contorno m&#225;s grande</span>
        largest_contour = <span style="color: #c099ff;">max</span><span style="color: #c099ff;">(</span>contours, key=cv2.contourArea<span style="color: #c099ff;">)</span>
        
        <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Encontrar el centro del contorno usando un c&#237;rculo m&#237;nimo que lo rodee</span>
        <span style="color: #c099ff;">(</span><span style="color: #ff995e;">(</span>x, y<span style="color: #ff995e;">)</span>, radius<span style="color: #c099ff;">)</span> = cv2.minEnclosingCircle<span style="color: #c099ff;">(</span>largest_contour<span style="color: #c099ff;">)</span>
        
        <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Dibujar el c&#237;rculo y el centro en el frame original si el radio es mayor que un umbral</span>
        <span style="color: #c099ff;">if</span> radius &gt; 10:
            i=i+1
            cv2.circle<span style="color: #c099ff;">(</span>frame, <span style="color: #ff995e;">(</span><span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>y<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>radius<span style="color: #ff995e;">)</span>, <span style="color: #ff995e;">(</span>0, 255, 255<span style="color: #ff995e;">)</span>, 2<span style="color: #c099ff;">)</span>
            cv2.circle<span style="color: #c099ff;">(</span>frame, <span style="color: #ff995e;">(</span><span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>x<span style="color: #ff98a4;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>y<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>, 5, <span style="color: #ff995e;">(</span>0, 255, 255<span style="color: #ff995e;">)</span>, -1<span style="color: #c099ff;">)</span>
            cv2.rectangle<span style="color: #c099ff;">(</span>frame, <span style="color: #ff995e;">(</span><span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>x-radius<span style="color: #ff98a4;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>y-radius<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>, <span style="color: #ff995e;">(</span><span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>x+radius<span style="color: #ff98a4;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff98a4;">(</span>y+radius<span style="color: #ff98a4;">)</span><span style="color: #ff995e;">)</span>, <span style="color: #ff995e;">(</span>0, 0, 255<span style="color: #ff995e;">)</span>, 3<span style="color: #c099ff;">)</span>
            img2 = frame<span style="color: #c099ff;">[</span><span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>y-radius<span style="color: #ff995e;">)</span>:<span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>y+radius<span style="color: #ff995e;">)</span>, <span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>x-radius<span style="color: #ff995e;">)</span>:<span style="color: #c099ff;">int</span><span style="color: #ff995e;">(</span>x+radius<span style="color: #ff995e;">)</span><span style="color: #c099ff;">]</span>
            cv2.imwrite<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">"/home/likcos/tarjeta/tarjeta"</span>+<span style="color: #c099ff;">str</span><span style="color: #ff995e;">(</span>i<span style="color: #ff995e;">)</span>+<span style="color: #c3e88d;">'.jpg'</span>, img2<span style="color: #c099ff;">)</span>
            cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img2'</span>, img2<span style="color: #c099ff;">)</span>
    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Mostrar el frame</span>
    cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'Frame'</span>, frame<span style="color: #c099ff;">)</span>
    cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'img2'</span>, img2<span style="color: #c099ff;">)</span>
    cv2.imshow<span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'Mask'</span>, mask<span style="color: #c099ff;">)</span>

    <span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Salir si se presiona la tecla 'q'</span>
    <span style="color: #c099ff;">if</span> cv2.waitKey<span style="color: #c099ff;">(</span>1<span style="color: #c099ff;">)</span> &amp; 0xFF == <span style="color: #c099ff;">ord</span><span style="color: #c099ff;">(</span><span style="color: #c3e88d;">'q'</span><span style="color: #c099ff;">)</span>:
        <span style="color: #c099ff;">break</span>

<span style="color: #7a88cf;"># </span><span style="color: #7a88cf;">Liberar la captura y cerrar todas las ventanas</span>
cap.release<span style="color: #c099ff;">()</span>
cv2.destroyAllWindows<span style="color: #c099ff;">()</span>

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: likcos</p>
<p class="date">Created: 2024-09-30 lun 23:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
